[{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_WrightCenter_fmt.jpeg"
"name":"The Wright Center of Innovation in Biomedical Imaging at The Ohio State University"
"url":"http://www.radiology.osu.edu/11205.cfm""
"story":"The Wright Center of Innovation in Biomedical Imaging (WCI-BMI) is a non-profit research enterprise organized under The Ohio State University Research Foundation to create an innovative academia/Ohio industry interface to develop, validate and perform services using leading-edge imaging technologies. Since its initiation through funding under the Ohio Third Frontier framework, it has helped create multiple imaging technologies that have been successfully commercialized by Ohio-based companies. The WCI-BMI also serves as the lead organization of the Ohio Imaging Research and Innovation Network (OIRAIN) that has created a new service delivery solution enabling the capability of state-of-the-art positron emission tomography (PET) and computed tomography (CT) imaging, not only at The Ohio State University campus, but now available throughout the State of Ohio via mobile services. Within the qualification timeframe, the WCI-BMI teamed up with Battelle Health and Life Sciences (Columbus, OH), also a non-profit organization, as well as Medpace (Cincinnati, OH), a for-profit CRO, to perform innovative preclinical and clinical trials for Ohio companies using newly available imaging technology that is commercially developed and manufactured by Philips Healthcare in Cleveland, OH."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_CenterforPersonali_fmt.jpeg"
"name":"The Center for Personalized Health Care at The Ohio State University Medical Center"
"url":"http://www.cphc.osu.edu""
"story":"The Ohio State University Medical Center is transforming healthcare delivery from its current reactive mode of sick care, to a more proactive one that makes health care more predictive, preventive, personalized and participatory. This novel approach is called P4 Medicine. The future of medicine focuses on creating systems and processes to deliver key evidence-based practices and to stratify individuals into smaller precise populations to deliver these key interventions. The goal of P4 Medicine is to reduce healthcare costs, improve outcomes and deliver higher quality health care for patients. It embraces the interface between an individual’s unique DNA, environment and behavior to choose the right intervention at the right time for the right person. P4 Medicine utilizes advances in genomics and molecular diagnostics discoveries to provide predictive information that is necessary to tailor, or personalize, disease management approaches for each individual. Ohio State’s Medical Center is pioneering the advancement of P4 Medicine and is committed to improving people’s lives."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_CityOfDublin_fmt.jpeg"
"name":"The City of Dublin Recreation Services"
"url":"http://www.dublin.oh.us/recreation""
"story":"The City of Dublin provides quality and innovative services to both residents and businesses alike. Dublin’s energized corporate climate attracts start-up ventures, family-owned businesses and national and international corporations. Dublin’s diverse and sound economic base provides the foundation for the present and future stability of the city. The city’s continued economic vitality is the result of quality development, strategic planning and aggressive efforts to attract and retain high-quality commercial development. The primary purpose for the Dublin Entrepreneurial Camp, also known as The Dublin Apprentice, is to capture the entrepreneurial spirit inherent in teens by building strong, long-term and sustainable partnerships between teens, local government and businesses.This program creates a system of transfer of valuable knowledge among teenagers and local businesses that prepares the teens for the future needs of the business community and workforce."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_ColumbusMuseum_fmt.jpeg"
"name":"Columbus Museum of Art"
"url":"http://www.columbusmuseum.org""
"story":"The Columbus Museum of Art (CMA) has been a vibrant centerpiece of the Columbus community for over 130 years, providing creative and thought-provoking experiences for over 200,000 onsite and 400,000 unique, online visitors annually. CMA houses over 10,500 works of art, including an internationally recognized collection of European and American Modernism. The Howald, Sirak, Schumacher, Schiller, and Photo League collections are widely respected and provide inspiration for exhibitions and programs.On January 1, 2011, CMA unveiled the historic Elizabeth M. and Richard M. Ross Building and Center for Creativity following a fifteen-month renovation. The Center is over 18,000 square feet dedicated to experiences that foster creativity, imagination, critical thinking, and innovation; key skills for success in the 21st century. Distinct spaces include an Innovation Lab, designed as a “black box” studio for video and audio recording, a state-of-the-art Auditorium with HD recording/streaming equipment, and Wonder Room that incorporates works of art to inspire families to explore art together. We have packed forward-thinking technology and innovative thinking into these spaces to offer an array of programs for lifelong learning."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_CityOfColumbus_fmt.jpeg"
"name":"The City of Columbus"
"url":"http://www.columbus.gov""
"story":"The City of Columbus, Ohio is one the the best places to live, work and raise a family. Mayor Michael B. Coleman, elected officials and employees of the city government work everyday to maintain that high standard of service and quality of life for all Columbus residents, to keep Columbus neighborhoods vibrant, and to support the economic development of the entire Central Ohio region.MyColumbus encompasses four mayoral initiatives to help city residents: My Neighborhood, Get Active, Green Spot, and 311. The My Neighborhood campaign allows residents to easily select and map government buildings, local entertainment and retail venues, as well as other useful Columbus sites. The Get Active initiative enables residents to access an events calendar, park and trail guides and tips from prominent community members on healthy eating and exercise. The GreenSpot initiative encourages sustainable behavior with environmental facts and pointers. The app also includes a 311 submission section where residents can submit service requests from their mobile devices. Currently the application is available for iOS and Droid users."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_ColsStateInstructi_fmt.jpeg"
"name":"Columbus State Community College"
"url":"http://www.cscc.edu""
"story":"Columbus State Community College (CSCC) was founded in downtown Columbus in 1963 and currently serves more than 30,000 students in the regional metropolitan area through two campuses and nine off-campus centers. Offering 200-plus degree and certificate programs as well as continuing education and workforce development opportunities, CSCC has emerged as the state leader in Ohio for online learning enrollment.To help support its online learning efforts, CSCC’s Instructional Technologies and Distance Learning (ITDL) division is implementing a campus-wide initiative to unify and automate its lecture capture and streaming video delivery processes. Working with CSCC faculty and two primary vendors -- TechSmith and its turnkey Camtasia Relay desktop recording system, plus Kaltura and its online Content Distribution Network video platform -- ITDL has developed a streamlined, easy-to-use solution for faculty to capture and publish presentations throughout the campus. The result is an intuitive system that allows for virtually universal creation and delivery of educational content -- anywhere, anytime, by anybody, and to any device."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_CommunityRecycling_fmt.jpeg"
"name":"Community Recycling Campaign"
"url":"http://www.crcfbt.org""
"story":"Recycling makes a positive contribution to the global conservation of energy and it is important for social, economic, and environmental reasons. Though many recycling programs are available in cities, there is always a gap in public awareness on how to best use the recycling programs. One way to close this gap is to continue to promote awareness of recycling in the public. Four years ago, I started an effort to spread awareness about the dangers of e-waste. I found out many companies that offer recycling-options for electronics aren’t free. If households know how they can reach local recyclable organizations, charities, and the impact of e-waste, many electronics items would have been saved. We offered a free service to collect old computers to recycle or, if possible, to fix any minor-issues and donate them to local charities. So far we safely diverted nearly 50,000lbs of e-waste for proper recycling. What was a small effort is now a legitimate non-profit 501(c)(3) public charity. Our goal is to expand this project concept to many schools, nearby cities, and encourage more children to participate."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_ConnectOhio_fmt.jpeg"
"name":"Connect Ohio"
"url":"http://www.connectohio.org""
"story":"Connect Ohio has implemented a statewide broadband training program, Every Citizen Online (ECO), in order to increase sustainable broadband adoption in Ohio. The project provides free computer training sessions at public libraries, community colleges, community organizations, and educational centers throughout Ohio and teaches new users how to access the Internet and how to best utilize all the Internet has to offer.The goal of the project is to showcase the many educational, healthcare, economic, and communication benefits of broadband use, and to encourage adoption by residents statewide. Since the program’s launch in late December, 247 locations are offering the ECO program and more than 11,000 Ohio adults have taken advantage of the free basic computer training."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_NorthSouthFoundati_fmt.jpeg"
"name":"North South Foundation"
"url":"http://www.northsouth.org""
"story":"North South Foundation is a non-profit, all-volunteer driven organization. The Columbus chapter, founded in 2002, provides educational resources and encourages excellence in education for children. Our services mainly include: a) We conduct educational contests once a year for the children from K-12. Contests include spelling,vocabulary, math, science, geography, essay writing and public speaking. b) We started NSF preparation clubs last year to provide free tutoring services in the subjects of spelling, math, science, essay, public speaking, and geography. c) We provide scholarships ($250 each) for needy children in India for college education. These educational contests, workshops, and preparation-clubs are designed to encourage excellence among the Indian-American children and prepare them to enter into better colleges. Nearly 400 children are taking advantage of Columbus chapter services. Nearly 40 parent teachers are helping to run the weekly classes in three different locations including Bharatiya-Hindu-Temple, Sai-Temple, and New Albany Library. We are progressing every year as more volunteers join NSF, more donors’ make contributions, more children participate in the contests, and we are able to provide more scholarships to needy students in India."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_OhioDODD_fmt.jpeg"
"name":"Ohio Department of Developmental Disabilities"
"url":"http://www.dodd.ohio.gov/Pages/default.aspx""
"story":"The Ohio Department of Developmental Disabilities (DODD) has oversight for over 90,000 individuals served by county boards of developmental disabilities. Additionally, DODD is directly responsible for administering Medicaid waivers to provide service and support to over 25,000 individuals. This service delivery represents over $1 billion in Medicaid claims annually. DODD set out to improve its online access to information and services focusing on the entire landscape of the way DODD was interacting with and conducting business with its stakeholders. In response to this challenge, DODD IT staff developed an integrated solution that delivered website content and game-changing electronic business processes as part of a new DODD portal. The website and portal developed using Microsoft SharePoint featured process improvements that benefited stakeholders. Key elements of the portal are: Provider certification wizard; Electronic provider fee payments; Compliance Monitoring (CMO); Document imaging; Workflow automation; Single signon; and Provider search. Underlying the portal are a number of changes to infrastructure including Active Directory Federated Services (ADFS) with associated full implementation of the Microsoft Forefront Identity Manager (FIM)."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/CIY_JPMorganChase_fmt.jpeg"
"name":"JPMorgan Chase"
"url":"http://www.jpmorganchase.com""
"story":"Site Inspector is an iPad app developed to allow Facilities Managers to do building inspections of HVAC equipment, fire suppression systems, data centers and other critical platforms required to support thousands of JPMC buildings across the globe. It replaced unusable tablet PCs with spreadsheet-based forms with a touch screen app equipped with floor map graphics, system and part inventories, and real-time connections to maintenance systems and vendors. It’s implementation immediately removed two-days of lag between the identification of failing fire suppression system or chiller and the work required to bring it back to spec. It will save hundreds of thousands of dollars in energy costs annually and improve safety. The app required no end-user training and improved the productivity of the Facility Managers by 10-15% across the board."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/CIY_AEP2_fmt.jpeg"
"name":"American Electric Power"
"url":"http://www.aep.com""
"story":"AEP, one of the largest electric utilities in the US, has been an innovative leader in the development, evaluation and deployment of smart grid concepts, technologies and programs. Smart grid technologies are designed to improve the reliability and efficiency of the electric distribution grid, provide customers with tools to better understand and control their electrical demand and energy consumption, and produce societal benefits such as improved economic development and environmental performance. The Smart Grid commonly refers to a variety of field and back office technologies that include two-way wireless communication networks, smart meters, in-premise energy displays and control technologies, distribution grid automation equipment, distributed storage and generation sources, electric vehicles, smart appliances, and new information management and control systems. AEP has implemented these new technologies in customer’s homes, the distribution grid, and our back office to streamline work processes, improve order processing, reduce electric demand and energy consumption, and improve grid reliability. AEP has also implemented several new customer programs that leverage these technologies and provide customers the ability to reduce peak demand, reduce energy consumption and save money."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/CIY_Huntington_fmt.jpeg"
"name":"The Huntington National Bank"
"url":"http://www.huntington.com""
"story":"“Social Enterprise to drive growth and customer delight”Huntington, under CIO Zahid Afzal’s leadership, created an internal social media capability called hbook that has accelerated project delivery and end user adoption, helping the bank understand more about end user preferences to create an engaging experience that ultimately drives growth and customer delight."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/CIY_WorthingtonIndustr_fmt.jpeg"
"name":"Worthington Industries, Inc."
"url":"http://www.worthingtonindustries.com""
"story":"Worthington Industries (WI) is a leading diversified metals manufacturing company with 2011 fiscal year sales of approximately $2.4 billion. The Columbus, Ohio based company is North America’s premier value-added steel processor and leader in manufactured pressure cylinders. WI, including its joint ventures, employs approximately 8,500 people and operates 74 facilities in 12 countries. The WI IT department provides services and support to Worthington users throughout North America with global oversight.Our key innovation is a customized Agile approach combining Scrum with XP practices for an Oracle ERP solution. We built Agile on top of our ITIL and COBIT framework. To bolster quality, we added a DRIP (Defects Released to Production). WI IT is qualified for this award category because of our unique use of Agile for a manufacturing business partner. We are pioneering this hybrid approach to show that IT is a competitive advantage, and not just a cost center. By trying something different, we have brought radical change within the WI IT department to create a high-performance IT organization."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_Recentris_fmt.jpeg"
"name":"Rescentris, Inc."
"url":"http://www.rescentris.com""
"story":"Under the leadership of Jeff Spitzner, President, Co-Founder, and Chief Science Officer, Rescentris has become a leading global provider of enterprise Electronic Laboratory Notebook (ELN) software solutions for R&D organizations. 90% of scientists developing the next generation of inventions, discoveries, and new products for research organizations still use paper lab notebooks. Productivity and collaboration are limited because data and Intellectual Property are scattered across paper and computer file systems and unsearchable.Over 100 sites in commercial, academic, government and nonprofit research labs in biology and multidiscipline research now utilize Rescentris’ award-winning product CERF to achieve efficient, paperless laboratories. ELNs are a rapidly growing segment of the $17 Billion lab informatics market. As product visionary, Spitzner guided development of CERF’s unique platform, including semantic technologies, mobility and SaaS options, and innovative user interfaces and tools to win competitive deals. In 2011, Dr. Spitzner expanded Rescentris’ management team, raised new equity funding, and boosted sales revenues. Jeff received his Ph.D. from Ohio State and post-doctoral research at MIT. He has co-founded five technology companies and is a recognized worldwide technology leader."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_2Checkout_fmt.jpeg"
"name":"2Checkout.com, Inc."
"url":"http://www.2checkout.com""
"story":"Tom is CEO of 2Checkout.com, Inc. in Columbus, Ohio."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_BuckeyeInteractive_fmt.jpeg"
"name":"Buckeye Interactive"
"url":"http://www.buckeyeinteractive.com""
"story":"Brad Griffith is a engineer by education, specializing in web technologies. He takes pride in teaching and empowering clients to manage their own web presence with user-friendly technology, training, and ongoing service and support. With his unique combination of business strategy, web development and interactive marketing expertise, Brad has a proven expertise in web solutions with a significant return on investment."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_IdeaFoundry_fmt.jpeg"
"name":"Columbus Idea Foundry"
"url":"http://www.columbusideafoundry.com""
"story":"The Columbus Idea Foundry is a public facility for the technological, creative, entrepreneurial and educational communities in Central Ohio. We host conventional as well as digital design and fabrication resources (from welding, woodworking, and metal casting to CAD/CAM/CNC machining, 3D printing and laser cutting), offer affordable classes to the general public in the use of these tools, and then provide workshop access to members for a monthly fee and an hourly rate. We host rental studio and production space for 30+ individuals, small businesses, artists and innovators; perform micromanufacturing services for a number of businesses in Central Ohio and beyond; provide design/prototyping consultation; offer technology transfer services and educational outreach opportunities. In the last year, the Columbus Idea Foundry has expanded its brick-and-mortar workshop space ten fold (to 24,000 square feet), and Dr. Bandar’s novel social entrepreneurship business model has attracted the attention of representatives from Battelle, the Columbus Foundation, the Nation Science Foundation, the US FabLab Network, the Greater Columbus Arts Council, and other technological, entrepreneurial, educational and creative organizations."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_Ecycle_fmt.jpeg"
"name":"e-Cycle, Inc."
"url":"http://www.e-cycle.com""
"story":"e-Cycle empowers businesses and organizations to take a more responsible, secure and profitable approach to wireless recycling. Founded in 2005 by current CEO Chris Irion, e-Cycle was established on three guiding passions: a love of technology, environmental protection and charitable giving. Through extensive quantitative and qualitative research, as well as hands-on entrepreneurialism, Irion identified a critical need in the marketplace that crystallized e-Cycle’s business model helping enterprises turn old wireless technologies into new revenue while protecting their corporate reputation and safeguarding the environment. Today, e-Cycle has become the trusted wireless asset recovery and recycling partner to many of the largest organizations in the world. e-Cycle was recently ranked the #5 fastest growing, privately held environmental services company in the U.S. by Inc. magazine, and the #3 fastest growing, privately held company in Central Ohio in the Business First Fast 50. Irion recently won the Ernst & Young Entrepreneur of the Year Award in the Cleantech category for the South Central Ohio and Kentucky Region, and was honored at the national awards ceremony in Palm Springs."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_FoundersFactory_fmt.jpeg"
"name":"Founders Factory Ltd."
"url":"http://www.foundersfactory.com""
"story":"Founders Factory was established to help early stage companies rapidly become viable and sustainable businesses. We have a blend of what early stage companies require: expedited angel funding, agile technology development, lean acceleration and world class mentors.Our approach has been uniquely designed from best practices only true entrepreneurs know. Each member of Founders Factory is a seasoned, serial entrepreneur. We provide quick idea evaluation, fast funding, assistance in obtaining strategic first customers, development of products and the essential elements of starting and maintaining your company."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_Janova_fmt.jpeg"
"name":"Janova"
"url":"http://www.janova.us""
"story":"Janova is a provider of web-based, automated testing software designed to streamline the cumbersome task of software development and implementation. Located in New Albany, Ohio, Janova’s offerings are based on years of experience consulting with companies who struggled to find an efficient way to test software. Leveraging the power of the Cloud, Janova’s offerings are English-based and easy to implement, with no equipment investment and nothing to download. Janova does not require a long-term commitment and offers free support with packages available to fit any size organization, from a single user up to the enterprise."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_OSUCAR_fmt.jpeg"
"name":"The Ohio State University Center for Automotive Research"
"url":"http://www.car.osu.edu""
"story":"The OSU Center for Automotive Research, CAR, is an interdisciplinary research center located in a 50,000 square-foot building complex on the west campus of OSU. CAR conducts interdisciplinary research in collaboration with the OSU colleges of Engineering, Medicine, Business, and Arts and Sciences. CAR research aims to: develop efficient vehicle propulsion and energy storage systems; develop new sustainable mobility concepts; reduce the impact of vehicles on the environment; improve vehicle safety and reduce occupant and pedestrian injuries; increase vehicle autonomy and intelligence; create quieter and more comfortable automobiles. A team of 30 administrative and research staff supports the research of 30 faculty, 70 graduate and 50 undergraduate students, and maintains and makes use of advanced experimental facilities. Dr. Rizzoni has led CAR for over a decade, growing its research expenditures from $1M per year to nearly $10M today, and engaging CAR in a broad range of technology commercialization activities, start-up company incubation and spin-out, as well as in providing a broad range of engineering services to the automotive industry in Central Ohio and beyond."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_PeopleToMySite_fmt.jpeg"
"name":"People To My Site"
"url":"http://www.peopletomysite.com""
"story":"People To My Site is a Digital Marketing company that specializes in the franchise industry. We offer a Franchisee Platform that combines the technology typically reserved for enterprise-level businesses with a targeted, localized marketing approach that’s critical to the success of a small business owner. The result is a comprehensive Internet marketing and technology solution for a business that breaks the mold of typical franchise Internet solutions in today’s market."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_PlutoNetworks_fmt.jpeg"
"name":"Pluto Networks"
"url":"http://www.pluto-networks.net""
"story":"Larry Chaffin is the Chief Executive Officer & Chairman of Pluto Networks. Through his leadership the company has grown 42% from last year and expanded its customer base worldwide. Larry is an author and co-author of 16 published books, a judge at Interop Las Vegas, a writer for Networkworld and speaker. This is Larry’s fifth nomination for Executive of the Year and fourth in a row. Larry has lead his company to one great stat: over the last eight years he has added two Fortune 25 Companies as customers each year. Larry has also been nominated for Executive of the Year in the European Business Community. He has also been recognized by The Asian Technology Paper as one of the most influential people in the world for WAN Acceleration Technologies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_QuickSolutions_fmt.jpeg"
"name":"Quick Solutions, Inc."
"url":"http://www.quicksolutions.com""
"story":"Quick Solutions, Inc. is an information technology consulting firm headquartered in Westerville,Ohio. We provide technology consulting services in the following areas: Strategy, People, Processes, and Technology.My innovation is developing superior internal and external business practices and process practices that are typically unprecedented in small, closely held companies. These innovations set the stage to accomplish our Vision to be the most valued business and technology partner while executing our Mission to create value for our clients and opportunities for our employees.I am qualified for the award as I have personally created and driven this innovation and have achieved success within the Firm and recognition within the community."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYS_Znode_fmt.jpeg"
"name":"Znode, Inc. (subsidiary of Yell plc)"
"url":"http://www.znode.com""
"story":"Znode, a Columbus based company, is an industry leading ecommerce platform. Our innovative solution enables leading global brands to significantly increase their brand presence and revenues using innovative online franchising software. Vish joined Znode as the CEO in 2007. Since then he grew Znode from a headcount of 2 individuals to over 20 in just under 3 years. During that period Znode acquired over 300 leading brand name customers and was also awarded the #223 rank in the INC 500 list. We were ranked #21 in software nationwide and #1 in Columbus, Ohio in the technology category. Based on this tremendous success, Znode was acquired in July 2011 by Yell, a global company that owns YellowBook in the US and YellowPages in the UK and has over 1.5 million customers world wide. In addition to the acquisition, the Yell executive team also promoted Vish to Executive Vice President within the Yell Group. In his new role, Vish will have global responsibility for executing Yell’s ecommerce strategy -- a coveted position in this $3 Billion organization."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_OwensCorning_fmt.jpeg"
"name":"Owens Corning"
"url":"http://www.owenscorning.com""
"story":"Owens Corning (OC) is a world leader in building materials systems and composite solutions. Our products range from insulation and roofing used in residential, commercial and industrial applications, to glass fiber for reinforced composite materials used in transportation, electronics, marine, wind energy and other high-performance markets. OC extruded polystyrene (XPS) FOAMULAR products are produced by extruding polystyrene resins and additives with a blowing agent (BA) into insulating board product. OC used to use hydrochlorofluro carbon HCFC-142b (CH3 CF2Cl) as the BA. This molecule is an ozone depleting agent (ODP = 0.06), with high global warming potential (GWP = 2310, carbon dioxide = 1). OC successfully converted all foam manufacturing lines across the United States and Canada (all 4 plants) to a more environmentally friendly BA, 2009 - 2011. The new BA not only has zero ODP, but carries a combined GWP of 780. This is a 70% reduction in GWP from the base line. The zero-ozone-depleting formula is a significant improvement in the global warming potential than the previous system -- a level unmatched by competition."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_AEP_fmt.jpeg"
"name":"American Electric Power"
"url":"http://www.aep.com""
"story":"American Electric Power is an electric utility that serves over 5 million customers and its service territory covers approximately 200,000 square miles. AEP Ohio, a subsidiary of American Electric Power provides electricity to nearly 1.4 million customers in Ohio and West Virginia. The green innovation of the year product, Community Energy Storage (CES), is deployed in Columbus, Ohio.CES is a 25-kW battery-based energy storage system that provides 25kWH of energy to the electric grid. Individual CES units can be aggregated through communication and control to act as a fleet and provide multi-megawatt benefits to the electric grid. CES is the result of a specification that was developed and written by AEP and now used by the international community. CES systems can be deployed to solve a variety of electrical system problems that include renewable resource integration, capital deferral for upgrade and replacement of electrical equipment, increased service reliability by providing backup power to customers and optimal utilization of electric grid infrastructure."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_CommunityRecycling_fmt.jpeg"
"name":"Community Recycling Campaign"
"url":""http://www.""
"story":"Four years ago, I started an effort to spread awareness about the dangers of e-waste. It was a grassroots effort, just kids going door-to-door giving out brochures and bugging our neighbors. I found out many companies that offer recycling-options for electronics aren’t free. At the community level electronics-recycling is still relatively new in many cities. We offered a free-service to collect old computers to recycle or, if possible, to fix any minor-issues and donate them to local-charities. So far we safely diverted nearly 50,000lbs of e-waste for proper recycling. I also started an ADOPT-A-SCHOOL program in India to raise recycling-awareness in public-schools. So far we adopted 20 high schools to set up recycling knowledge centers. We donate $250 to each school in addition to match grants from adopted school and other local organizations. What was a small effort is now a legitimate non-profit 501(c)(3) organization. My goal is to expand this project concept to many schools, nearby cities, and encourage more children to participate. Each and every time I am reminded of what I can achieve with only determination."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_DatacenterBZ_Gordo_fmt.jpeg"
"name":"DataCenter.BZ"
"url":"http://www.datacenter.bz""
"story":"As a facilities based provider, DataCenter.BZ places special emphasis in the design of its building, infrastructures and operations. DataCenter.BZ is the only purpose-built, carrier-neutral data center in Central Ohio. Due to its unique facility design and operations, DataCenter.BZ has the ability to create significant energy efficiency advantages thus decreasing maintenance and operating costs. Municipal and corporate users, in turn, locate their ever-increasing data, applications and IT equipment at DataCenter.BZ not only for performance and uptime reasons, but also to leverage DataCenter.BZ’s energy efficiencies. In particular, those customers who make energy efficiency and environmental responsibility high priorities utilize DataCenter.BZ to reduce operating costs and substantially reduce the carbon footprints associated with their IT operations."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Elytus_fmt.jpeg"
"name":"Elytus Ltd."
"url":"http://www.elytus.com""
"story":"Elytus Ltd. is an environmental software-as-a-service (SAAS) firm founded in January 2007 and headquartered in Columbus, Ohio. Elytus products, including WInStream and WInStream|RFP, assist our clients in assembling a more sustainable solid waste and recycling program from procurement to payment. As an agent for our clients success, Elytus web-based software platforms help our clients reduce the amount of waste generated while also reducing their costs. We service companies who operate multiple locations throughout the United States and Canada and are themselves involved in the retail, restaurant, hospitality, grocery and industrial markets. Our solutions allow clients to effectively manage their solid waste employing proprietary smart decision making technology in the areas of solid waste, recycling and environmental sustainability."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Hull_fmt.jpeg"
"name":"Hull & Associates, Inc."
"url":"http://www.hullinc.com""
"story":"Founded by John Hull in Toledo, Ohio in 1980, Hull & Associates, Inc. is a project development and engineering company that helps business and government solve complex challenges related to land, energy, and the environment transforming undervalued resources into viable community assets. We leverage our expertise in property redevelopment, waste management, industrial applications, energy, and environmental engineering to design creative solutions to technically-challenging projects.Hull specializes in developing and managing renewable energy projects from concept through operation using solar, biomass, landfill gas, hydro and wind energy technologies. We specifically work with landfills, waste management, and industrial operations to evaluate the potential to generate renewable energy and improve energy efficiency, while using our financial and utility expertise to provide in-depth economic analysis and implement investment structures to maximize project returns. Hull is also uniquely positioned to help minimize client risk and capital requirements by becoming the owner and operator of the renewable energy facility -- a competitive specialty that is specifically demonstrated in our nominated Pilkington North America Solar Field Project."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_IGS_fmt.jpeg"
"name":"IGS Energy"
"url":"http://www.igsenergy.com""
"story":"IGS Energy is a family-owned natural gas and electricity supplier headquartered in Dublin, Ohio. Founded in 1989, IGS currently employs nearly 300 professionals, and operates in nine states with 850,000+ residential/small commercial customers and 4,500+ large commercial/ industrial customers. To accommodate our growth and reaffirm the value we place on energy efficiency and energy solutions, we began construction on our new headquarters. Upon completion, it achieved the status of a Platinum LEED NC Certified building, the only facility of its size and scale in Ohio, resulting in a nomination for TechColumbus’ Green Innovation Award.Careful consideration was placed when choosing each aspect of the building, allowing all of the renewable energy and latest technologies to be 50% more efficient than a LEED standard baseline ASHRAE 90.1 2004 code building. We are the first and only building of its size in Ohio to achieve Platinum LEED NC Certification enabling us to set an example for other companies to follow suit, demonstrating that an award like this is certainly reachable for other buildings of our size."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Innova_fmt.jpeg"
"name":"InnovaGreen Systems, LLC"
"url":"http://www.innovagreensystems.com""
"story":"InnovaGreen Systems holds several utility patents (Patent # 7560059) for processing and recycling cigarette butts. InnovaGreen Systems’ founding partnership created a dynamic team of professionals with a wide-range of complementary business experience. We are the solution to the growing problem of cigarette litter. InnovaGreen Systems is developing collection strategies and processing efficiencies to turn cigarette litter into useful and affordable products. InnovaGreen Systems is a green company that is committed to providing a solution to cigarette butt litter and improving our environment. Our commitment creates raw materials as feedstock for waste-to-value manufacturing, which ultimately helps eliminate this litter."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Replex_fmt.jpeg"
"name":"Replex Plastics"
"url":"http://www.replex.com""
"story":"Since its founding in 1991, Replex Plastics has grown to $3MM in sales with 22 employees. In 2006 Replex purchased and successfully renovated a dilapidated building into a 100,000 sq.ft. energy-efficient manufacturing facility for producing high optical quality plastic domes and mirrors. The renovations reduced gas usage by 90% over the previous tenant. Process improvements have since reduced electricity consumption by 30%. Replex continues to identify and implement changes to further reduce energy use. In 2008, Replex was awarded an Ohio Third Frontier grant to develop mirrors for concentrated solar power, and has been building on that success ever since. Sales of Replex manufactured components for solar applications have exceeded $200,000 to date and continue to grow. Replex is now integrating mirrors into Photovoltaic (PV) modules to supply a complete solar product line, expected to be launched over the next 18 months."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Terracal_fmt.jpeg"
"name":"Terracal"
"url":"http://www.terracal.com""
"story":"Terracal delivers thermal storage systems for commercial buildings based upon Aquifer Thermal Energy Storage (ATES). We have developed a method for immobilizing a portion of an aquifer, allowing us to use it to store lots and lots of cold. We then use this cold in the summer to cool your building. Our simple controls, easy to use interface, and novel approach to aquifer management allow our system to be used all over the United States.This high efficiency, sustainable cooling system competes effectively with conventional fossil fuel systems, providing a cost-effective alternative for new commercial buildings and buildings where cooling systems are being replaced. It provides the lowest cost of ownership in comparison to all technologies currently available in the cooling market; in many cases, even the initial cost for a Terracal system will be lower than comparable conventional systems. Our system provides a means for businesses and institutions to reduce energy costs, meet sustainability goals, reduce peak electricity demand, and obtain LEED certification without paying a premium for these advantages."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_ThirdSunSolar_fmt.jpeg"
"name":"Third Sun Solar"
"url":"http://www.thirdsunsolar.com""
"story":"Third Sun Solar is a fast-growing design/build solar contractor serving Ohio and the surrounding states. Founded in 2000 and based in Athens, Ohio, Third Sun Solar has regional offices in Columbus, Cincinnati and Akron. Third Sun Solar manages solar energy system design and installation for commercial, non-profit, institutional, municipal and residential customers across the Midwest. Third Sun Solar founders Geoff and Michelle Greenfield began working in solar installation in 1997 when they built their own 100% solar powered home. They have grown the Third Sun Solar business through their passion for the environment, commitment to promoting clean energy, and excitement in providing high quality jobs and a great place to work. Third Sun Solar employs a team of nationally-certified NABCEP installers along with design engineers, financial analysts, grant specialists, and support staff. As of mid 2011, Third Sun Solar has installed over 300 projects with a total generating capacity nearing 3 megawatts in pursuit of the goals of bringing solar energy into the mainstream and accelerating the growth of clean energy."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_TippingPoint_fmt.jpeg"
"name":"Tipping Point Renewable Energy"
"url":"http://www.tipenergy.com""
"story":"Tipping Point Renewable Energy has formed the Ohio Solar Communities Consortium to help school districts, municipalities and non-profit organizations to secure financing for solar power purchase agreements that would otherwise not be feasible."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/GRN_Toxco_fmt.jpeg"
"name":"Toxco Inc."
"url":"http://www.toxco.com""
"story":"There are over 2 Million hybrid and electric vehicles on the roads today. By 2020 hybrid and electric vehicles will soon account for as much as 11 percent of all vehicles sold in the U.S. Toxco Inc. is a leading resource recovery company that utilizes innovative approaches for recoverable valuable, non renewable resources from spent energy systems. Toxco has developed a unique approach for the recovery and recycling of these resources from a variety of battery materials. Most notably, Toxco has developed technology to recover valuable rare earths from large nickel metal hydride batteries, and high energy cathode materials from lithium ion batteries, that are used in hybrid vehicle applications."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYL_TheDispatch_fmt.jpeg"
"name":"The Dispatch Printing Company"
"url":"http://www.dispatch.com""
"story":"The Dispatch Printing Company is a locally owned privately held media company, owning a daily newspaper, 23 weekly newspapers, a sports radio station, a broadcast CBS affiliate in Columbus, OH and an NBC affiliate in Indianapolis, IN. The combined properties also own and operate 23 web sites. The digital strategy, initially spearheaded by IT, is “Content Anywhere, On Anything at Anytime.” recognizing customer demand to move from traditional media to any electronic screen. This year we launched a bold new approach to our web sites utilizing Amazon Cloud, open source software and our internal staff to propel the current strategy and establish a solid foundation for future evolution. We finalized an agreement to change our newsprint format from the 150+ year old traditional format, to a new 3V format. After over 2 years of work, we are defining our printing facility as the location to print not only The Columbus Dispatch but also a letter of intent to publish the Cincinnati Enquirer. This innovative new product in the newspaper industry establishes ours as a premier production facility for Ohio."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/EYL_Greif_fmt.jpeg"
"name":"Greif, Inc."
"url":"http://www.greif.com""
"story":"Greif, Inc. is a world leader in the manufacture of industrial packaging products and the provision of related services. With locations in more than 55 countries and net sales of $3.5 billion in fiscal 2010, the company produces steel, plastic, fiber, flexible, corrugated and multiwall containers and containerboard, and provides reconditioning, blending, filling and packaging services. Founded in 1877 and headquartered in Delaware, Ohio, Greif is listed on the New York Stock Exchange under the symbols GEF and GEF.B."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_HealthCareDataWork_fmt.jpeg"
"url":"http://www.hcdataworks.com""
"story":"Health Care DataWorks provides hospitals and health systems with business intelligence solutions that provide a unified view of all of the data that runs throughout their organizations. With increasing amounts of data, much of it created and stuck in disparate application silos, business and clinical leaders cannot quickly and accurately get at the root cause of the many issues that impact patient quality, operational costs and overall performance. Health Care DataWorks, solves this problem by providing an “out of the box” fully functioning enterprise data warehouse appliance complete with all of the hardware and software needed to get fast results. At the core of Health Care DataWorks innovation is a robust unifying data model for healthcare organizations along with over a dozen pre-built dashboards and hundreds of standard reports. For those organizations aspiring to become high-performance, information-driven operations, Health Care DataWorks is their logical business intelligence partner. Founded in 2008, Health Care DataWorks continues to win business over its much larger competitors and is recognized for providing innovative and potentially transformative solutions."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Acceptd_fmt.jpeg"
"url":"http://www.getacceptd.com""
"story":"Acceptd is a web-based tool that simplifies the video application process for university programs. Uploading and managing application videos, audition tapes, and highlight films using Acceptd will streamline the process and save time and money for applicants and program directors."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Bringshare_fmt.jpeg"
"url":"http://www.bringshare.com""
"story":"BringShare is an Internet-based tool designed to help marketing professionals, entrepreneurs and businesses measure and evaluate their online marketing investments more efficiently and cost-effectively. It is unique because it compiles online marketing initiatives-website analytics, SEO, social media, email marketing, paid search-into a single, easy-to-comprehend dashboard. BringShare presents data in a way that makes it simple to identify which efforts provide the best return on investment, which approaches need to be modified, and initiatives that aren’t paying off.Created by co-founders Danielle Walton and Justin Spring, BringShare streamlines and answers the challenges associated with generating and explaining marketing data reports. Because BringShare was created by experienced marketers for people leveraging online marketing strategies, there is a keen understanding of what data reports are critical versus data that is just nice to know. BringShare affords marketers to produce exceptional reports in a fraction of the time and expense it would take someone to create manually. In September 2011, BringShare became the first Ohio company invited to Silicon Valley to present at DEMO-the launchpad for emerging technologies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_CARTechnologies_fmt.jpeg"
"story":"CAR Technologies has commercialized a suite of testing, modeling and controls engineering services that allow major OEMs to validate the lifecycle operational and control strategies of their proposed hybrid/electric vehicle or large-scale stationary energy storage applications. Because of the unique know-how that is employed, very high-accuracy models allow for 1) better control and operation of the advanced battery system across a wider range of operation (e.g. very low states-of-charge, low temperatures), 2) flexible vocational modeling and simulation for systems architecture development and refinement, and 3) better decisions about aging for end-of-first-life decision-making, and 4) proactive ways to make decisions about battery re-use, second life application for large-scale energy storage, and recycling. CAR Technologies, with the help of the OSU Center for Automotive Research, designed, assembled and commissioned the largest testing and engineering center south of Detroit in less than six months. CAR Technologies is a tier 1 supplier to several major OEMs, profitable, and cashflow positive in its first year of operation."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_IdeaFoundry_fmt.jpeg"
"url":"http://www.columbusideafoundry.com""
"story":"The Columbus Idea Foundry is a public facility for the technological, creative, entrepreneurial and educational communities in Central Ohio. We host conventional as well as digital design and fabrication resources (from welding, woodworking, and metal casting to CAD/CAM/CNC machining, 3D printing and laser cutting), offer affordable classes to the general public in the use of these tools, and then provide workshop access to members for a monthly fee and an hourly rate. We host rental studio and production space for 30+ individuals, small businesses, artists and innovators; perform micromanufacturing services for a number of businesses in Central Ohio and beyond; provide design/prototyping consultation; offer technology transfer services and educational outreach opportunities. In the last year, the Columbus Idea Foundry has expanded its brick-and-mortar workshop space ten fold (to 24,000 square feet), and Dr. Bandar’s novel social entrepreneurship business model has attracted the attention of representatives from Battelle, the Columbus Foundation, the Nation Science Foundation, the US FabLab Network, the Greater Columbus Arts Council, and other technological, entrepreneurial, educational and creative organizations."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_DedicatedTech_fmt.jpeg"
"url":"http://www.dedicatedtechservices.com""
"story":"From attack and penetration testing and disaster recovery planning to managed firewall and intrusion detection systems, Dedicated Tech Services, Inc. (DTS) is committed to delivering state-of-the-art security solutions that meet industry best standards and practices. DTS helps to ensure that its clients are protected against the wide range of threats that face their infrastructure. Those threats can be anything from natural disasters to malicious employees or the stereotypical attacker."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_DoMedia_fmt.jpeg"
"url":"http://www.domedia.com""
"story":"DOmedia is the online marketplace for Out-of-Home Media. Through the largest database of OOH companies and inventory, DOmedia provides suites of tools and resources that allow agencies and brands (large and small) to efficiently plan and buy exceptional advertising campaigns.Powered by a clear vision and tireless commitment to delivering value, DOmedia has cut through the inertia and disrupted a “traditional” media industry. This is no small feat, and certainly not one for the timid!"
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_eSolutech_fmt.jpeg"
"url":"http://www.esolutech.com""
"story":"eSolutech provides innovative web and mobile IT solutions to fuel a company’s growth. Our unique IT offerings go beyond the traditional practices that are commonly known as IT staffing solutions. What we are offering are innovation and creativity in Technology. We recommend IT solutions to our clients by figuring out their underlying business issues."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Fabrisonic_fmt.jpeg"
"url":"http://www.fabrisonic.com""
"story":"Fabrisonic is an Ohio start-up established to sell equipment and services related to the patented Ultrasonic Additive Manufacturing (UAM) process. UAM uses the power of sound to metallurgically bond layers of metal foil. The process produces true metallurgical bonds with full density and works with a variety of metals such as aluminum, copper, and stainless steel. In combining additive and subtractive process capabilities, UAM can create deep slots, hollow, latticed, or honeycombed internal structures, and complex geometries impossible with conventional subtractive manufacturing processes. Additionally, the solid state nature of the UAM bond allows for welding of dissimilar metals. This enables dissimilar metal cladding, production of custom metal matrix composites, and the ability to embed objects or sensors in a metal substrate. Through the use of UAM, customers will be able to manufacture complex parts that have unique features and attributes not possible using traditional manufacturing techniques. In addition, parts currently made with traditional operations can be made with less waste, an increasingly important factor as more expensive, higher performance materials see broader use."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Future%20Path%20Medica_fmt.jpeg"
"url":"http://www.future-path.net""
"story":"Future Path Medical (FPM) has brought disruptive innovation to medical devices for clinical fluid management beginning with urine, but additional applications will be considered in the future. The FDA cleared the iBag System as a 510K Class II device. This first product family will solve major problems for the spinal cord injured and home care segment. The UroSense S product family is targeted for engineering completion and FDA submission later in 2012.Future Path Medical has raised and invested $2.1MM, been granted two U.S. Patents, #7,739,907 and #7,892,217. There is a third provisional patent in place. This intellectual property protects the company for its planned execution including its technology, sensors, and system elements. The patents are currently valid internationally in some areas, others are being considered for an international filing protection by management."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_GotCast_fmt.jpeg"
"url":"http://www.gotcast.com""
"story":"GotCast.com is Hollywood’s largest interactive community for entertainment executives, talent, and fans. Casting directors have cast nearly 20,000 projects on GotCast, thus helping GotCast’s members to secure thousands of roles in TV and film. With over 350,000 members around the country, GotCast is the premier destination for auditions, casting calls, and networking within the Hollywood community.GotCast’s social media-based contest platform, MediaBlastr, is the premier crowd-sourcing resource for Hollywood and Madison Ave. MediaBlastr powers talent and content contests sponsored by top brands like L’Oreal, Dove, Garnier Fructis, Sony Playstation, Maxim Magazine, and VH1. Each campaign powered by MediaBlastr results in millions of organic impressions and unprecedented levels of engagement."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Hungerly_fmt.jpeg"
"url":"http://www.hungerly.com""
"story":"Hungerly is enabling the gourmet street food scene to thrive by putting mobile food vendors on a level playing field with brick-and-mortar restaurants. We are addressing the disadvantages presented by varying locations and hours by offering a mobile marketing, sales and logistics platform built around real-time maps, centralized ordering and automated marketing across multiple channels. Not only do we drive business but we empower gourmet mobile food vendors to focus on what they do best: make good food and provide the unique one-on-one customer experience that can only be had at a food truck or cart."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Innova_fmt.jpeg"
"url":"http://www.innovagreensystems.com""
"story":"InnovaGreen Systems holds several utility patents (Patent # 7560059) for processing and recycling cigarette butts. InnovaGreen Systems’ founding partnership created a dynamic team of professionals with a wide-range of complementary business experience. We are the solution to the growing problem of cigarette litter. InnovaGreen Systems is developing collection strategies and processing efficiencies to turn cigarette litter into useful and affordable products. InnovaGreen Systems is a green company that is committed to providing a solution to cigarette butt litter and improving our environment. Our commitment creates raw materials as feedstock for waste-to-value manufacturing, which ultimately helps eliminate this litter."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_IntelligentID_fmt.jpeg"
"url":"http://www.intelligentid.com""
"story":"Intelligent ID (IID) is a pioneering User Activity Management System that enables unprecedented visibility into events that impact the security of organizations. Through monitoring data usage, Intelligent ID effectively uncovers threats, recovers costs, increases productivity, improves compliance and enhances data loss prevention within organizations. Founder and CEO Jim Mazotas has founded and owned small businesses in Ohio for 10 years. He started Intelligent ID in 2010 upon observing organizations’ inability to maintain control of their data security, resulting time and time again in financial loss due to non-compliance, expensive litigation, intellectual property theft and negative impact to reputation.As information becomes accessed and shared at an increasingly rapid pace, leaving unprotected data vulnerable, a need for innovation was clear. With a talented team and clear vision, Intelligent ID has already begun to change the face of online and offline security. Its breadth of functionality and analysis along with an intuitive, user-friendly and highly customizable interface are proving invaluable to the security of clients in the finance, energy, government, healthcare industries and more."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_iPinion_fmt.jpeg"
"url":"http://www.ipinionsurveys.com""
"story":"iPinion has created a disruptive product and business model for Consumer Insights and Market Research in the mobile world. Explosive growth of smartphones and tablets and the associated behavioral change among users triggered the iPinion idea. The idea was converted into a powerful business solution, by the founders and executive management who collectively bring rich expertise in Consumer Insights and Mobile Technology. Soon after the launch, iPinion started to enjoy excellent market traction, and is recognized as the leading solution for consumer insights in the mobile space. iPinion taps the power of mobile and uses it innovatively to gain consumer insights.Established in 2010, the company released its Beta version in June 2010 and an enterprise grade, market ready solution in June 2011. The company generated revenue in excess of USD 100,000 from 16 client wins within four months (July-Oct 2011) of its market release, besides generating over USD 80,000 from Beta customers in 2010. Top Market Research companies like GfK, Ipsos, Gallup and top brands like General Mills, Philips, Basspro use iPinion for consumer insights in the mobile world."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Janova_fmt.jpeg"
"url":"http://www.janova.us""
"story":"Janova is a provider of web-based, automated testing software designed to streamline the often cumbersome task of software development and implementation. Located in New Albany, Ohio, Janova’s offerings are based on years of experience consulting with companies who struggled to find an efficient way to test software. Leveraging the power of the Cloud, Janova’s offerings are English-based and easy to implement, with no equipment investment and nothing to download. Janova does not require a long-term commitment and offers free support with packages available to fit any size organization, from a single user up to the enterprise."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Libre_fmt.jpeg"
"url":"http://www.libreclothing.com""
"story":"Libre is a clothing line designed for chemotherapy and dialysis patients undergoing routine treatments. The company was started after watching family members freeze while going through dialysis. We recognized the need of this niche market that was not being served; this was a business opportunity for a growing need that could help millions of people worldwide. Our clothing features an invisible zipper where access is needed for treatment. This allows patients to stay warm during treatment, while keeping their treatment site visible for safety purposes. Our clothing helps prevent issues with covered access areas such as bleed outs and infection. Libre means open and free in many languages, representing the literal opening in our clothing and the freedom to wear what patients want on treatment days. Our passion is to help patients look good and feel comfortable during a difficult time. We currently offer four styles and five different colors. Online sales started in April 2010 and have been growing ever since. We continue to work on new designs that fit our customers’ lifestyles."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_LogoMyWay_fmt.jpeg"
"url":"http://www.Logomyway.com""
"story":"LogoMyWay.com connects clients needing logo designs to a creative community of more than 15,000 talented logo designers all around the world. Any business can start a logo design contest within minutes and see imaginative design submissions within a few hours!Clients can start logo contests for a $200 minimum prize up to a $1,000 maximum. The higher the prize amount, the more submissions of a higher quality will be received. During the contest, clients rank logo submissions and leave feedback based on their design preferences. As the contest continues, the design community can read the feedback along with real time rankings and fine tune their logo submissions. When the contest ends, the clients select a winner and all of the associated logo files are uploaded to them. They also receive a free legal contract providing 100% full legal ownership of their new design. LogoMyWay.com is the perfect avenue to obtain a unique, professional logo design at an affordable price. With talented designers throughout the world offering their logo concepts, its hard to go wrong since LogoMyWay.com guarantees 100% satisfaction."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_MCS2_fmt.jpeg"
"url":"http://www.mcs2solutions.com""
"story":"MCS2 offers a unique service to healthcare providers by satisfying an urgent need in mandated privacy to medical records, tests and visit notes. Their expertise is the merging of successful careers in healthcare IT leadership, security and delivery. With great energy and a win:win attitude, they’ve ’reinvented’ themselves, capitalizing on shared strengths. The business model capitalizes on the growing threats of data breaches coupled with the government’s stimulus reimbursement for healthcare providers. MCS2 offers patients secure and private medical records, affords providers more efficiencies, long-term savings and assurance of compliance with no threat of fines and penalties. MCS2 ’interprets’ and satisfies governments’ intricate mandates and regulations and is the bridge to ’Meaningful Use’ and verification of HITECH and ARRA. In addition, MCS2 promises minimal down-time to medical staffs daily demands and once start-up begins, executes remotely. In a relatively short period of time this start-up venture has made impressive gains and intends to diversify and expand their service offerings as their delighted client base expands and market demands grow."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_PHMatters_fmt.jpeg"
"url":"http://www.phmatter.com""
"story":"pH Matter, LLC is a start-up company dedicated to providing solutions in emerging markets related to nano-materials and catalysis. The company was formed in 2010, and is located at the TechColumbus business center. The core business of pH Matter includes the development of catalysts, and scalable production methods for these materials. In 2011, pH Matter developed technical innovations in the manufacturing of nano-materials based on boron, nitrogen, and carbon chemistry, and the use of these materials for a variety of applications. The primary application for pH Matter’s materials are as catalysts for the oxygen reduction reaction, an important reaction for a number of applications, including fuel cells, electrolysis, and metal-air battery electrodes. Current customers for pH Matter materials include the DoD, NASA, and commercial partners. pH Matter’s technology will lead to a suite of products and services that enable these materials to be adopted by customers. The impact felt by adoption of the materials will span from energy storage for cars, electronics and grid load leveling, to improved efficiency industrial electrolysis."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Poms_fmt.jpeg"
"url":"http://wbsinccd.tripod.com/pomsinc/""
"story":"Poms, Inc. is a technology startup that has an innovation solution for the creation and delivery of digital mail for the United States Postal Service and internationally. Charles E. Campbell is an African American Entrepreneur, born with the gifts of innovation and invention. He’s a graduate of Jackson State University, The Ohio State University, Columbus State Community College, Kauffman Foundation For Entrepreneurial Education FasTrac I & II Programs and OSU AAACEC Ray Miller Institute for Change & Leadership. He’s the Founder & CEO of a renewable energy startup (AHEC) http://www.ahecEnergy.com, and has innovations in biotechnology (Kures, Inc), transportation, social collaboration (Cuptoopia.com), aerospace, agriculture, robotics and social empowerment. He understands the transformational potential of his innovations and believes in fair business competition without Greed, Fear or Racism."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_QStart_fmt.jpeg"
"url":"http://www.qstartlabs.com""
"story":"QStart Labs provides start ups, investors, and established firms an experienced technology development and start up advisory team made up of entrepreneurs, designers, nerds, and investors that are changing the way that new businesses are launched on the web.QStart Labs not only flexes their muscles through technology innovation but also through a unique business model that creates alignment with the success of the companies they choose to partner with."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_ReturnOnIngredient_fmt.jpeg"
"url":"http://www.returnoningredients.com""
"story":"Mark Kelnhofer founded Return On Ingredients LLC in January 2009 and currently serves as the company’s President & CEO. Kelnhofer had an extensive manufacturing accounting background and in 2002 was hired by the Bravo Brio Restaurant Group to develop a system that managed the restaurant’s costs in a similar way including accurate recipe costing, just-in-time production and ordering processes and menu engineering. During his tenure at BBRG he was able to reduce costs five consecutive years, which resulted in millions of dollars of savings. It did not take long to see that there was a large need for better tools in the industry to assist in the overall profitability of the operation. The Return On Ingredients software solution took Kelnhofer’s manufacturing and restaurant background and create a new tool for operators to be proactive about identifying all their costs (ingredients, labor and overhead) and to methodically plan for profitability."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Terracal_fmt.jpeg"
"url":"http://www.terracal.com""
"story":"Terracal delivers thermal storage systems for commercial buildings based upon Aquifer Thermal Energy Storage (ATES). We have developed a method for immobilizing a portion of an aquifer, allowing us to use it to store lots and lots of cold. We then use this cold in the summer to cool your building. Our simple controls, easy to use interface, and novel approach to aquifer management allow our system to be used all over the United States.This high efficiency, sustainable cooling system competes effectively with conventional fossil fuel systems, providing a cost-effective alternative for new commercial buildings and buildings where cooling systems are being replaced. It provides the lowest cost of ownership in comparison to all technologies currently available in the cooling market; in many cases, even the initial cost for a Terracal system will be lower than comparable conventional systems. Our system provides a means for businesses and institutions to reduce energy costs, meet sustainability goals, reduce the use of electricity at peak demand times, and obtain LEED certification without paying a premium for these advantages"
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_TheMetropreneur_fmt.jpeg"
"url":"http://www.themetropreneur.com""
"story":"The Metropreneur was created by Walker and Anne Evans in August of 2010 with the sole purpose of strengthening the entrepreneurial environment in Central Ohio and to help support our small business community. We achieve that by providing breaking news and announcements, business profiles and spotlights, highlighting local and regional trends, providing advice columns from business professionals and a wide variety of other types of valuable and interactive content.Our role goes beyond just telling the story of our entrepreneurial community, and provides resources for virtual business incubation. We’ve compiled a Local Resource Database that contains hundreds of regional resources ranging from financial assistance providers to marketing resources to social media consultants."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_TheSpaMarketplace_fmt.jpeg"
"url":"http://www.thespamarketplace.com""
"story":"As founder and president of The Spa Marketplace.com, Loren Stone’s inspiration came from over 17 years in the hospitality, spa and wellness industries. He envisioned something bigger, utilizing ecommerce to develop a marketplace for consumers, buyers and suppliers. A marketplace to forge relationships all the while remaining committed to a lifestyle of health, wellness and natural choices.It was imperative to develop an online community for the free flowing exchange of ideas and thoughts to shape these communities for the years to come. A goal was aligning the business with like-minded partners making a difference in the education of these lifestyles. The Spa Marketplace.com is designed for the consumer market and the spa/wellness professional. In addition, a home office, order processing, and fulfillment complex is located in Columbus, Ohio. In order to achieve our goals we maximized open source platforms, while integrating dynamic interfaces for education, sale of goods/services and the promotion of a healthy and wellness lifestyle. Our mission is to bring a product that is superior to the alternatives while penetrating international markets."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Updox_fmt.jpeg"
"url":"http://www.updox.com""
"story":"Updox, LLC is a web based front office communications solution for medical practices which improves their efficiency and patient care. It is the only service in the ambulatory healthcare market to provide a HIPAA compliant patient portal, electronic fax, document management, secure messaging, and Electronic Health Record (EHR) integration module in a single platform. In 2011, the company entered into sole source distribution agreements with 7 new EHR partners in addition to 2 EHR partnerships established in 2010. Updox is sold as a monthly subscription model and is currently being used by over 900 practices with 2.4 million patients in its database."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_VantagePoint_fmt.jpeg"
"url":"http://www.vantagepointlogistics.com""
"story":"Vantage Point Logistics, LLC (VPL) helps fund higher education’s future by putting money back into a university’s budget. The VPL program provides an easy way for universities to help offset the federal and state budget cuts that are affecting all schools, and driving up tuition costs. It is based on the fact that vendors are overcharging our universities on shipping costs for the items they are ordering every day. Through experience and technology, VPL converts those overcharges into savings of 35%, on average, which can be hundreds of thousands of dollars annually. With Vantage Point Logistics’ program in place, universities have to do very little to obtain those savings. Other industries have very successfully taken control of their freight costs, and now it is time for higher education to do the same with the Vantage Point Logistics freight program."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_Watershed%20Distille_fmt.jpeg"
"url":"http://www.watersheddistillery.com""
"story":"Watershed Distillery produces world class spirits by hand using a custom built copper still. We operate out of a small space in Columbus, Ohio. Founded by Greg Lehman and Dave Rigo, both born and raised in Central Ohio, Watershed currently distills a corn based vodka and a modern gin with a unique aromatic blend of botanicals."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSB_WhannTech_fmt.jpeg"
"url":"http://www.whanntech.com""
"story":"Whanntech develops software applications and promotes best-of-class technology solutions. Whanntech’s first product, VINdriven, is an in-the-lane decision support tool designed to give both auto dealers and consumers detailed vehicle information in an instant. The simple interface provides access to: vehicle history reports, valuation resources, VIN explosion, and the industries first presentation of recall data. The second release is VINimage, an automated photo and vehicle ID matching tool. Next to launch is Transact Auto, which enables both consumers and dealers to create robust condition reports and detailed listings for both retail and wholesale channels. Transact Auto’s listing engine currently supports auttr.com, an automotive social portal that provides visibility to over 1.8 million vehicle listings from over 20,000 automobile dealers. The post-a-car feature allows consumers to post their vehicle with three easy steps. Each of these tools is anchored by a proprietary barcode scanner that eliminates errors and enhances efficiencies. Whanntech is founded by Keith Whann, who represents the interests of auto dealers and independent auto auctions on Capitol Hill. Mr. Whann is recognized as the CAR COUNSELOR to the auto industry."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_EcycleTeam_fmt.jpeg"
"url":"http://www.e-cycle.com""
"story":"e-Cycle empowers businesses and organizations to take a more responsible, secure and profitable approach to wireless recycling. Founded in 2005 by Christopher and Tonia Irion, e-Cycle was established on three guiding passions: a love of technology, environmental protection and charitable giving. e-Cycle collects wireless devices from businesses, reimbursing them for devices that retain value and recycling all others at no charge through an ISO Certified, EPA-registered facility. e-Cycle has a strict zero landfill policy. The information on every phone is either deleted or destroyed through the industry’s most rigorous data security measures. Once the data is completely scrubbed, e-Cycle resells the devices overseas where the used technologies are greatly needed. e-Cycle was recently ranked the #5 fastest growing, privately-held environmental services company in the U.S. by Inc. magazine, and the #3 fastest growing, privately-held company in Central Ohio in the Business First Fast 50. CEO Christopher Irion recently won the Ernst & Young Entrepreneur of the Year Award in the Cleantech category for the South Central Ohio and Kentucky Region, and was recently honored at the national awards ceremony."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_2Checkout_fmt.jpeg"
"url":"http://www.2Checkout.com""
"story":"2Checkout.com (2CO) has been in business for 11 years and is a processor of online payment transactions for ecommerce websites. 2CO manages the payment process for 60,000+ online sellers and millions of buyers located in 205 countries around the globe. 2CO supports 30+ global currencies and 20 languages during the purchase checkout process. 2CO is one of a small handful of truly global payment processors, and has more global reach than most of its competitors. The company also offers industry-leading risk and fraud management tools."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_889Global_fmt.jpeg"
"url":"http://www.889globalsolutions.com""
"story":"889 Global Solutions, Ltd. is an innovative Ohio-based one-stop contract manufacturer sourcing work to China. Founder/CEO Judy Huang’s business skills and knowledge of China’s culture, language, and business practices simplify outsourcing and logistics for American businesses, giving clients savings of 20%-45% possible from Asian manufacturing. 889 works with healthcare and industrial clients whose demanding production and quality needs include GMP, ISO and FDA approval during manufacturing. Product lines include minimally invasive surgical instruments, disposable and durable medical goods, metal fabrication, industrial components, and consumer/promotional items. 889 has supervised production of FDA 510(k) approved nasopharyngeal airway tubes and tracheobronchial suction catheters. During the qualification period, nearly 60% of 889’s revenue came from healthcare manufacturing, increasing from 0% just a few years ago. 889 has been profitable for 11 straight years. Clients include a Fortune 200 medical products company, Sensotec (Honeywell), InfoSight, NASCAR, and the California Angels. A Rotarian, Judy serves on the boards of Franklin University and the Community Capital Development Corporation, is an active member of Xenos Christian Fellowship, and serves as a role model, particularly for women in business."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_AllRFriends_fmt.jpeg"
"url":"http://www.allrfriends.com""
"story":"all R friends provides direct care for adult individuals with developmental disabilities. Our staff provide a safe, loving environment for individuals to come and learn skills which increase their ability to live independently. Staff help teach computer, cooking, social, life and job skills and more, while also going into the community. Our staff maintain a positive and happy environment on a daily basis, which, in return, has a positive impact on the folks we serve. We are making a positive difference in the lives of those we serve; we are like family. Our staff know the importance of everyone feeling that they have a purpose."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Alta%20Sim%20Technolog_fmt.jpeg"
"url":"http://www.altasimtechnologies.com""
"story":"AltaSim Technologies’ unique multiphysics computational analysis capabilities support companies operating at the intersection of innovation, application of technology and novel product development across the spectrum of markets, technologies and company size. AltaSim’s approaches to Virtual Product Development (VPD) allow the customer to design, evaluate and predict the behavior of new products and technology in a virtual environment thereby reducing the need for physical prototypes. Benchmark studies have shown that AltaSim’s approaches can reduce the cost of technology development by up to 90% and the time by up to 50%. AltaSim Technologies is putting powerful, practical, cutting edge simulation tools into the hands of the end-user, positioning them to create new jobs, innovative products and novel technologies more efficiently. AltaSim Technologies has helped companies develop new technology for monitoring prosthetic heart valves, environmentally responsible energy production, patient treatment protocols for novel radiation therapy, manufacturing processes for next generation aero-engines, medical imaging technology, simulation of large scale electronic circuits, novel construction methods for US Navy ship structures and new automotive manufacturing processes."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_AstuteSolutions_fmt.jpeg"
"url":"http://www.astutesolutions.com""
"story":"Astute Solutions was founded in 1995 on the belief that engagement with customers should be leveraged as a strategic advantage. That fundamental belief has guided our company’s growth and evolution throughout our 17 years in business. As advancements in technology evolved the world’s communications channels, so then, did our offerings. From the call center to the web or the ever-expanding social world, we sought to develop innovative services in response to and anticipation of our customers’ growing needs. Astute Solutions has built a Social Media Service that we call Social Relationship Management (SRM). This service uses consumer opinion from over 150 million sites to help our clients learn from their consumers. This service aggregates incredible quantities of data, then provides a range of tools to do everything from identifying macro trends to interacting with individual consumers."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_BCR-PointofSale_fmt.jpeg"
"url":"http://www.bcrpos.com""
"story":"BCR Point of Sale (POS) is Ohio’s fastest growing Point of Sale company. We provide solutions and service to the Hospitality, Retail and other related markets.We were approached by the Memorial Tournament, Jack Nicklaus’s PGA event at Muirfield Village, to provide a POS solution for their annual tournament. BCR combined several technologies along with service to their internal and external teams to exceed the expectations of tournament director, Dan Sullivan."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_BOEHM_fmt.jpeg"
"url":"http://www.boehmautomation.com""
"story":"BOEHM has a 60 year history in Ohio manufacturing; providing the most innovative and technologically creative Marking, Coding, and Labeling solutions into the Food, Beverage, Pharma, Chemical, Industrial Manufacturing, and Consumer Goods space. BOEHM integrates machinery into the production lines that applies the traceability marks which communicate codes/symbologies which may be human-readable and/or machine readable. Think “Born On” date on the bottom of your soda can, or the automotive part number & 2D Data Matrix “barcode” on transmission & engine parts which Honda or Ford may receive from their Tier One supplier. BOEHM creates solutions for this technology and then uses the “Track and Trace” ability of our equipment by creating databases which help protect consumers against recalls and mis-labeling by being able to bring up the “products license plate” within its automation systems."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_CentennialAssociat_fmt.jpeg"
"story":"Founded in 2003, Centennial Associates LLC is a small boutique management consulting firm. We assist the management of start-ups, not-for-profits, university licensing groups, and corporate executives in corporate development and licensing groups of large corporations. We assist them as they acquire new technologies, establish new businesses or strategic alliances, develop strategy, raise funding, invest as LP’s, license technology and grow revenue to enhance shareholder value."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_DatacenterBZ_Gordo_fmt.jpeg"
"url":"http://www.datacenter.bz""
"story":"DataCenter.BZ offers datacenter and mission critical IT solutions, including colocation, virtual data centers and disaster recovery. DataCenter.BZ’s customer base comprises national and international government entities, Fortune 1000 companies and small to medium sized businesses.Its facility and infrastructures are built to guarantee that power and connectivity are never a problem, ensuring customers’ IT infrastructure is available 24x7 and providing customers with peace of mind that they always have unlimited access to their data. With direct access to over a dozen carriers, customers’ telecom costs are reduced while network uptime is dramatically improved, all while substantially lowering customers’ own capital and operating costs. DataCenter.BZ’s campus represents one of Ohio’s largest collections of carrier/municipal/private fiber networks and serves as a critical point of interconnection among the carriers, dark fiber networks and last mile providers in Central Ohio. By providing use of such power and connectivity assets as a service to a range of Central Ohio’s government and businesses, together with 24x7 support, DataCenter.BZ allows customers to operate more securely and profitability, with greater IT performance in an increasingly network dependent world."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Dynamit_fmt.jpeg"
"url":"http://www.dynamit.us""
"story":"Dynamit is a digital agency and consultancy. We deliver technology solutions and innovative thinking to our clients to overcome business challenges they have today while creating new opportunities for tomorrow. Our work across industries is a true strength with client relationships in quick-service restaurants, manufacturing, utilities, healthcare, media, not-for-profit, travel & tourism, logistics, business-to-business (B2B) and consumer packaged goods sectors.We employ a logical process and a multi-disciplined team working with client stakeholders in marketing, strategy, commerce, communications and IT across organizations. Our ability to take responsibility for entire projects -- from strategy to design to development and integration -- has enabled us to build beautiful, user-friendly websites that drive impactful results."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Expedient_fmt.jpeg"
"url":"http://www.expedient.com""
"story":"Expedient Communications offers a wide range of managed hosting services such as virtualization, cloud computing, remote backups, management of equipment, storage area networks and more. These proven managed services combined with their eight top tier data centers enables Expedient to deliver premium colocation, network and managed services solutions to commercial, education and government entities. This blend of services, all under one roof, and the scale of the organization really sets Expedient apart from the competition. It enables them to have a complete view of their clients’ technical environment and makes Expedient accountable for ensuring that their customers’ systems will interact properly and have 100% uptime.During 2011, Expedient opened the most hardened commercially available data center in central Ohio. With the addition of this facility, companies in this region now have access to a single source provider for their primary computing and disaster recovery services. Previously they would have needed to work with multiple companies which can creates gaps in accountability or they would need to move their systems outside of the region. In two words Expedient provides DATA AVAILABILITY."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_GotCast_fmt.jpeg"
"url":"http://www.gotcast.com""
"story":"GotCast.com is Hollywood’s largest interactive community for entertainment executives, talent, and fans. Talent executives have cast nearly 15,000 projects on GotCast helping GotCast’s members to secure thousands of roles in TV and film. With nearly half a million members around the country, GotCast is the premier online destination for auditions, casting calls, and networking within the Hollywood community.GotCast’s social media-based contest platform, MediaBlastr, is the premier crowd-sourcing resource for Hollywood and Madison Ave. MediaBlastr powers talent and content contests sponsored by top brands like L’Oreal, Dove, Mercedes-Benz, Garnier Fructis, Sony Playstation, Maxim Magazine, and VH1. Each campaign powered by MediaBlastr results in millions of organic impressions and unprecedented levels of engagement."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Halcyon_fmt.jpeg"
"url":"http://www.halcyonit.com""
"story":"Since 1992, Halcyon Solutions has delivered on-time, on-budget, state-of-the-art technology innovations to its Fortune 500 clients. The company specializes in Custom Software Development (J2EE/.NET), ERP (SAP, Oracle), Data Warehousing, Business Intelligence and Microsoft Technologies (SharePoint/CRM).Check Ohio First is a service developed by the first Public-Private partnership between the State of Ohio and Halcyon that seeks to bring growth and business opportunities to the State of Ohio and serve as a catalyst to economic growth in the State. The service allows businesses to register and provide marketing-ready information to buyers. Buying agencies can search for providers using virtually any search criteria that represents their buying process. Check Ohio First can also facilitate the collaboration process between groups of companies through the use of online webinars, team sites and social media. An innovative feature of Check Ohio First is the ability to create a secure online working environment for a project team with representatives from various companies. The secure team environment provides various collaboration aids, use of social media tools and the ability to conduct webinars and online presentations."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Hungerly_fmt.jpeg"
"url":"http://www.hungerly.com""
"story":"Hungerly is enabling the gourmet street food scene to thrive by putting mobile food vendors on a level playing field with brick-and-mortar restaurants. We are addressing the disadvantages presented by varying locations and hours by offering a mobile marketing, sales and logistics platform built around real-time maps, centralized ordering and automated marketing across multiple channels. Not only do we drive business but we empower gourmet mobile food vendors to focus on what they do best: make good food and provide the unique one-on-one customer experience that can only be had at a food truck or cart."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Improvedge_fmt.jpeg"
"url":"http://www.improvedge.com""
"story":"ImprovEdge believes anyone can improvise. The company has been providing business training using improvisation as the learning catalyst for over 12 years. By breaking the boundaries of how to provide adult learning, both in-person and via technology, ImprovEdge has continued to be a leader in cutting-edge business training in leadership, inclusion and diversity, negotiation, sales and creativity. Social media and digital learning becomes surprising, engaging and improvisational in these new formats. ImprovEdge won the Athena PowerLink Award for outstanding woman-owned business, is a certified Women’s Business Enterprise and clients include JPMorgan, Coach, Turner Broadcasting and Battelle among many. The company has a presence in seven cities and its work is based on original research with Wharton Business School and Otterbein College. The founders met as undergraduates at Yale University, cut their improv teeth with the Second City of Chicago, and now include the author of the #1 Amazon Bestseller in category, The Improvisation Edge: Secrets to Building Trust and Radical Collaboration at Work."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_improveit_fmt.jpeg"
"url":"http://www.improveit360.com/""
"story":"Developed by home improvement industry experts for remodelers and contractors, improveit! 360 is a business management application designed to control chaos, accelerate growth, lower costs and improve operational efficiencies. With improveit! 360, remodelers are able to generate and close more leads while reducing their marketing costs, automating communications, tracking every customer interaction from one centralized location, and getting a 360° view of their operation for better decision making. Built on the force.com platform, the application is remotely accessible via the web, highly secure, reliable and scalable."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_ITMartini_fmt.jpeg"
"url":"http://www.itmartini.com""
"story":"John Bishop and Aladin Gohar founded IT Martini because IT Professionals in Columbus weren’t socializing as an IT Community. There weren’t many opportunities to do so. In the Summer of 2008, nearly two hundred IT Pros attended the very first IT Martini event.The demand for IT Community events in Columbus was apparent, so more were hosted. Hundreds of IT Pros began participating in the IT Martini Hour format featuring panel discussions, DEMOs, and local charities. The format quickly caught on with IT Communities outside of Columbus during the Summer of 2009. At that point, the IT Martini mission began: to connect IT Pros in YOUR IT Community with events that focus on leadership, entrepreneurship, philanthropy, and FUN."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_JulieWilkes_fmt.jpeg"
"url":"http://www.juliewilkes.com""
"story":"Julie Wilkes, and her divisions of Julie Wilkes Inc, offers an innovative and unique approach to inspiring people to live their best life every day. As a personal trainer, fitness, yoga and pilates instructor, life coach and motivational speaker, Julie found that she could reach more people, in powerful ways, by leveraging technology. Julie built her own iphone app that provides daily motivation, workouts, life coaching and ’pay it forward’ challenges. In addition, Julie leverages her own public ’webshow’ channel to offer a weekly talk show on various health and life topics as well as various workouts, guided meditations and breathing exercises. She also conducts ongoing health, happiness and ’life empowerment’ webinars. Julie also sends her subscribers a weekly videoemail, in which she challenges her listeners with a healthy goal to focus on over the following 7 days. Julie has been able to use technology to reach people in personal, inspiring and educating ways to empower them to be healthy, happy and living life to the fullest."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_PathwaysToSuccess_fmt.jpeg"
"url":"http://www.ptsphysicians.com""
"story":"PTS Physicians primarily produces high quality benchmarks for hospital-owned physician practices. Anticipating changes in healthcare delivery in the U.S., several hospitals have acquired physician practices to be able to provide a continuum of care. A major problem faced by hospital administrators is the absence of trustworthy benchmarks to assess the performance of physician practices.The benchmarking market is dominated by MGMA and AMGA, both of which collect self-reported summary data from physician practices, aggregate the data, and generate benchmarks for distribution. Several concerns about the validity of these benchmark data, their timeliness, and their stability over time have been expressed. PTS developed a process by which transaction level data are collected, cleaned, standardized, and used to generate benchmarks. The superiority of these benchmarks has been noticed by various hospitals and industry partners, which enabled us to sign up over 500 hospital-owned practices last year. PTS is also developing a major application which integrates physician data with hospital data, thus enabling further analysis to isolate the drivers of quality of care. PTS qualifies under the Business Approach category."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Pearl%20Interactive__fmt.jpeg"
"url":"http://www.pearlinter.org""
"story":"Pearl Interactive Network is a for profit social enterprise that delivers high quality contact center services that include: call center, help desk and administrative services. While our primary goals is to deliver quality service, we provide opportunity to people with skills and talents who have challenges to work such as: Disabled Veterans, people with disabilities and people living in geographically challenged areas (such as Southeastern Ohio).Through accessing a VOIP phone system and creating a software bridge with assistive technologies, we have been able to employ people with strong skills and talents who have a range of disabilities. As of January 2012 we will have close to 60 employees and an additional 40 who will be subcontracting through a relationship in Philadelphia. We are in the process of launching a bricks-and-mortar contact center located in Logan, Ohio. This development furthers our mission of creating jobs for skilled and talented people located in geographically challenged areas. Logan, Ohio has double digit rates of unemployment."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_PlutoNetworks_fmt.jpeg"
"url":"http://www.pluto-networks.net""
"story":"Pluto Networks is a worldwide leader in emerging technologies specializing in WAN Acceleration, Security, Networking, Voice and Video. We have earned a reputation with our customers for providing solutions that provide great return on investment. Pluto Networks offers an integrated family of core technology practices with a concentrated focus and a proven track record. Unlike many companies, we don’t have 25 or even 50 different vendors to sell to our customers. We offer a handful of products which provide value to our customers. We offer service worldwide in 26 countries now and expanding year to year."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_PortfolioCreative_fmt.jpeg"
"url":"http://www.portfolioiscreative.com""
"story":"Portfolio Creative is a recruiting and staffing firm that connects clients with creative professionals. We help clients find creative individuals for their marketing and advertising needs on a full-time or temporary basis. After seeing the need for this type of service for years, Kristen Harris and Catherine Lang-Cline started the business in 2005 to serve the marketing and advertising community in a way that was different than typical staffing. The business is focused on making big and small differences in the lives of our clients and talent. This includes finding the perfect creative person for each of our clients’ projects. But it also may involve career counseling or counseling the client on what will work best for them. We are constantly refining our business to better serve the needs of our talent and our clients."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Possitivity_fmt.jpeg"
"url":"http://www.possitivity.com""
"story":"For 35 years Possitivity has been a strategic partner in solving our customers’ business needs. Services include document management, janitorial services and electronic waste recycling. In January 2009 Possitivity initiated electronic waste recycling services for businesses, municipalities, civic organizations and residents. Possitivity guarantees zero landfill globally, safe erasure or destruction of data, (a serialized certificate of destruction is available for a nominal processing fee) and offers a letter of donation to our customers. Possitivity will pick up electronic waste from its business customers. Partnerships with central Ohio municipalities and civic organizations provide the public an opportunity to recycle e-waste properly at various locations throughout the years."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_ResponsibleSolutio_fmt.jpeg"
"url":"http://www.communityreset.com""
"story":"Responsible Solutions for Energy Transition (Re:SET) facilitates the deployment of community-wide solutions for sustainable energy generation in an affordable way. Focusing first on the rural community, Re:SET is able to integrate conservation and efficiency, waste-to-energy, co-generation, and multi-process technologies to transform existing community “problems” into generative solutions. By working with entire communities, costs of financing, administration, technology, and installation can be aggregated to affect shared savings. The Re:SET model represents the efficient utilization of local energy resources, as well as leveraging appropriate and existing economic and development resources."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_Tek%20Orange_fmt.jpeg"
"url":"http://www.tekorange.com""
"story":"tekOrange’s VPS service provides virtualized computing services for small business. From under $30/month businesses can access cloud resources for performing computing tasks such as short term marketing campaigns, prototyping of applications, external acceptance testing, email & collaboration services, web hosting, and virtual desktop.tekOrange provides both Linux and Windows virtual servers. The offering allows the end user to avoid the expensive capital purchase of a physical server and the recurring cost of its upkeep and maintenance. The realized savings provide improved cash flow for the end customer."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_TowerWireless_fmt.jpeg"
"url":"http://www.towerwireless.com""
"story":"Tower Wireless is a Premium Retailer that operates retail stores for Verizon Wireless throughout the Midwest and Southeast regions of the United States. We are market leaders in each of our operating regions and are in the process of expanding our business throughout the country.We have designed, manufactured, and built a state-of-the-art digital signage solution specifically designed for the retail industry. Originally designed for use by our Verizon Wireless retail locations digital signage has become the building block for our print and signage division. "
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_WebbedMarketing_fmt.jpeg"
"url":"http://www.webbedmarketing.com""
"story":"Founded in 2006, and now a division of Fathom Online Marketing, Webbed Marketing services more than 60 organizations across the United States. Our clients include leading healthcare organizations, cutting-edge technology companies, educational institutions, membership and advocacy groups, professional service providers and nationwide retailers. We’ve been featured in dozens of media outlets for our expertise in online marketing. We’ve spoken at more than 100 conferences across the country. We’ve won awards and have executed campaigns that have gained international attention. But none of that really matters. What we’re most proud of is our 93% client retention rate and that our very first clients are still with us. We are proud that most of our business comes from referrals. We are proud of the fact that every day we help organizations thrive using technology."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSS_WorthPoint_fmt.jpeg"
"url":"http://www.worthpoint.com""
"story":"WorthPoint is the leading online resource for collectible enthusiasts. It provides the deepest, broadest reference data set available for art, antiques and collectibles worldwide. Before WorthPoint was established, there was no single place online to help people value, preserve, buy and sell items.Described as the “Bloomberg” of the industry, WorthPoint provides a vast database of sales records aggregated from eBay, virtual marketplaces and leading auction houses worldwide. It’s called Worthopedia and includes more than 100 million auction sales results. In addition, WorthPoint offers articles written by subject-matter experts called Worthologists, who also provide item valuations through the Ask-A-Worthologist service.During the qualification period for this award, WorthPoint achieved several successes: its paid subscriber base increased by 80% to 18,000, the data in Worthopedia doubled to more than 100 million auction sales results and revenue doubled. WorthPoint’s innovation also translates into success for its subscribers. When a woman found a painting in a trashcan, she turned to WorthPoint. After discovering it was truly a treasure, she sold it at Sotheby?s for $103,000. WorthPoint helps people discover their hidden wealth."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSL_OCLC_fmt.jpeg"
"url":"http://www.oclc.org""
"story":"OCLC is a global library cooperative dedicated to furthering access to the world’s information and reducing library costs. The economic environment has negatively impacted library budgets while increasing the demand for library services. Library funders, leaders, and staff are continually balancing available resources to meet the needs of their communities. Behind the scenes, the systems that support the work of a library selecting, acquiring, describing, and delivering collection materials are largely based on decades-old technology running on local servers. OCLC’s integrated Webscale Management Services introduces a cloud-based system with unified and simplified workflows for these mission-critical back office activities of the library. WMS facilitates sharing of infrastructure costs and resources. Libraries can also share data, applications and workflow improvements with peer institutions, end users and partners. For patrons, the world’s libraries’ collective catalogs become visible on the Web through search engines and via their preferred access points. Over 150 libraries worldwide have selected WMS, and it is already in use in over 30 libraries serving 95 branch locations."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSL_Donatos_fmt.jpeg"
"url":"http://www.donatos.com""
"story":"As the pizza category has evolved from simply ordering a carry out from your neighborhood pizzeria to the ultra competitive category of today, it takes much more than just a great tasting pie to win the hearts of loyal customers. Convenience and price have become greens fees in the pizza wars today, so differentiating yourself from your competition in these two critical areas is the key to success. Since Donatos has set the quality and taste standard for pizza in the Columbus market since 1963, it was imperative for the chain to attract customers with an online ordering system that was the technological equivalent of putting 100 pieces of pepperoni on a large pepperoni pizza! Donatos rolled out their new and improved system in July of 2010 and the sales results have been dramatic."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSL_InformationControl_fmt.jpeg"
"url":"http://www.iccohio.com""
"story":"The ICC Information Factory, an onshore data integration delivery service, was developed by Information Control Corporation. ICC’s Information Factory focuses exclusively on converting outsourced offshore markets by delivering data integration solutions in Central Ohio at a cost equal to offshore vendors, while providing superior quality results at a faster pace. In addition to providing a Zero Defect Guarantee to clients on their Information Factory implementations, ICC has developed an accurate estimating process that allows the company to confidently generate detailed Information Factory fixed priced outcome-based contracts -- unheard of in offshore models. Through innovation, a unique data integration delivery model, and an established training academy for Central Ohio talent, Information Factory offers a groundbreaking cost-competitive alternative for clients who are considering using offshore vendors for their business intelligence needs, or have been dissatisfied with their offshore experience. "
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSL_Nationwide_fmt.jpeg"
"url":"http://www.nationwide.com""
"story":"When a disaster strikes, it is Nationwide’s job to rebuild our members’ lives to the extent that money and caring can. The Claims Bankcard project brought together Nationwide Bank, Nationwide I.T., and a strategic merchant provider to create an innovative solution that provides instant access to claim payments during a period of loss, allowing members to start rebuilding their lives immediately. The Claims Bankcard is an innovation that is critical to fulfilling our mission and differentiating our services to our members and potential customers. During the unprecedented catastrophic weather events in 2011, Claims Bankcards were a key component of Nationwide’s presence in impacted communities, supporting Nationwide’s continued leadership in catastrophe response within the industry. The convenience of the card (distribution and usage) is a differentiating customer experience for our members during their time of loss and has a direct correlation to the increased customer satisfaction scores Nationwide has realized in 2011."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OSL_ReasearchInstitute_fmt.jpeg"
"url":"http://www.nationwidechildrens.org/research-informatics-core""
"story":"The Research Informatics Core (RIC), located at The Research Institute at Nationwide Children’s Hospital, is a high performance, innovative, and agile informatics service provider. RIC supports the Centers of Emphasis located in The Research Institute, Clinical Researchers, and National Cancer Cooperative Group and international disease consortiums/consortia. RIC provides custom application development, data integration and analytical services, image based solutions, and overall informatics consulting.Innovation is a key ingredient to the continued success of RIC. The innovative solutions are focused in the fields of translational research, telemedicine, and predictive and personalized medicine. RIC has developed a high dimensional data warehouse solution to support clinical trials running in a cloud environment, multiple data collection applications running on mobile devices to enhance patients experience, and advance digital pathology applications utilizing a natural user interface (voice and gesture controls) and cutting-edge web-based image viewer. RIC, through its state-of-the-art solutions and services, is advancing the field of informatics while aiming to increase the cure rates and decreasing the side effects in disease."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_OSU_Giusti_fmt.jpeg"
"url":"http://www.fic.osu.edu/member/Monica%20Giusti""
"story":"Consumption of fruits and vegetables is linked to lower incidence of chronic diseases. Therefore, there is great interest to determine what compounds in fruits and vegetables are responsible for those beneficial effects. Anthocyanins are the natural pigments responsible for most of the orange to red to blue to purple colors in nature. These compounds are potent antioxidants and are widely distributed in nature. They are believed to play an important role on the health-enhancing properties of fruits and vegetables. However, it is difficult to know for sure as they usually coexist with many other compounds, and isolating them into pure forms makes them extremely expensive. This candidate led the development of a novel isolation technique using solid phase extraction and a unique combination of solvents to achieve highly purified anthocyanin mixtures at low costs and high efficiency. A company: AnthoScyantific has been created to apply this technology for the production of large volumes of nature’s purest and most colorful antioxidants. For the first time, large scale in vivo studies of biological activity of these compounds will be possible."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_Accenture_fmt.jpeg"
"url":"http://www.accenture.com""
"story":"Accenture is a global management consulting, technology services and outsourcing company, with approximately 236,000 people serving clients in more than 120 countries, including over 400 employees based in Columbus. In addition to serving our clients, Accenture employees are encouraged to become involved with, and make a difference through, a variety of community and environmental programs. Paula O’Reilly is a Partner in the Columbus office and through Accenture’s Corporate Citizenship initiatives, became involved with a nonprofit organization, NPower (www.NPower.org). With NPower, Paula spearheaded an effort to build a portal that connects nonprofits to skilled IT volunteers across the world. Built on Sales Force Dot Com technology, The Community Corps (https://thecommunitycorps.secure.force.com/) was piloted in the fall of 2010 and progressed to full production in 2011. To date, over 9,000 IT volunteer hours have been logged through an automated nonprofit to volunteer match process."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_Bizwatch_fmt.jpeg"
"url":"http://www.bizwatchsearchanalytics.com""
"story":"Laura Thieme founded SMI Analytics, Inc. DBA Bizwatch in 2010 after 14 years of running a search marketing agency. Thieme has spoken at nearly 40 national and international search marketing conferences on how to improve visibility, traffic, sales and profitability in Google and other search engines. Thieme developed Bizwatch, a web-based software that measures online advertising, search and social marketing campaign performance. Bizwatch is geared towards retailers and B2B companies spending greater than $5,000 a month in Google Adwords or pay per click (PPC) advertising campaigns, and engaging in SEO and social media marketing efforts. Bizwatch not only measures and trends year over year performance, but catches common advertising and SEO mistakes, alerts the marketing manager on how to fix them, and is currently in the process of automating the PPC and SEO management work flow process."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_Bringshare_fmt.jpeg"
"url":"http://www.bringshare.com""
"story":"BringShare is an Internet-based tool designed to help marketing professionals, entrepreneurs and businesses measure and evaluate their online marketing investments more efficiently and cost-effectively. It is unique because it compiles online marketing initiatives -- website analytics, SEO, social media, email marketing, paid search -- into a single, easy-to-comprehend dashboard. BringShare presents data in a way that makes it simple to identify which efforts provide the best return on investment, which approaches need to be modified, and initiatives that aren’t paying off. Created by co-founders Danielle Walton and Justin Spring, BringShare streamlines and answers the challenges associated with generating and explaining marketing data reports. Because BringShare was created by experienced marketers for people leveraging online marketing strategies, there is a keen understanding of what data reports are critical versus data that is just nice to know. BringShare allows marketers to produce exceptional reports in a fraction of the time and expense it would take someone to create manually. In September 2011, BringShare became the first Ohio company invited to Silicon Valley to present at DEMO the launchpad for emerging technologies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_ewi_fmt.jpeg"
"url":"http://www.ewi.org""
"story":"EWI is an international thought-leader on materials joining and allied technologies. It uses manufacturing technology innovation to increase the competitiveness of over 2,700 member locations of global leaders in the aerospace, automotive, defense, petrochemical, government, heavy manufacturing, and electronics industries. It is an independent nonprofit corporation located adjacent to The Ohio State University. EWI acts as an intermediary to develop, mature, commercialize and transition technologies to industry for specific applications. EWI also operates a variety of technology-based centers and consortia to further increase manufacturing innovation. Michelle manages EWI’s intellectual property patent portfolio and is integral in the commercialization of EWI’s technologies. With a background in business and law, Michelle is able to understand her customer’s needs (both internal and external) and act as a liaison between the engineering community, the managing business partners, and the U.S. Patent and Trademark Office. Recently, Michelle applied her business experience and knowledge combined with research performed in the area of patent valuation and developed a Technical Prospectus document to guide EWI decision-making in the areas of technology investment and commercialization."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_MetcalfAssoc_fmt.jpeg"
"url":"http://www.metcalf-associates.com""
"story":"Metcalf & Associates is a management consulting and leadership development firm dedicated to helping leaders, their management teams, and their organizations implement the innovative leadership practices necessary to thrive in a rapidly changing environment. Included in these offerings is speaking, training, coaching, team building, and organizational transformation. We help shift perspectives, strengthen organizational awareness and increase executive capacity. Today’s successful executives need to optimize their performance at individual, organizational, and global scale, and we are dedicated to inspiring leadership innovation within complex business environments. Innovative Leadership Fieldbook is a leading text for managers, executives and individual contributors providing a combination of well-researched theory with practical business case studies. It defines leadership from a thoughtful, new perspective and provides a six-step process for developing strong leadership qualities. This female-published book will drive organizations’ ability to successfully implement innovative change globally. It is well researched and has already gotten global attention at the Integral Global Collaborative Conference along with a glowing review in Integral Leadership Review by Harvard Professor Jim Ritchie-Dunham."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_Nationwide_fmt.jpeg"
"url":"http://www.nationwide.com""
"story":"This nomination recognizes Susan Gueli as a leader in Information Technology with success in many aspects of leadership and especially in improving associate engagement. Susan Gueli is the SVP, CIO Nationwide Financial. Susan is responsible for leading all technological business solutions including the development and maintenance of systems which serve NF customers, producers, and associates. Susan was named as one of the Top Ten Women in Leadership in the Insurance Industry by Insurance Networking News for her contributions to the business.In her 25 year career at Nationwide, Susan has served as Vice President, Information Risk Management; Associate Vice President, Infrastructure Technology Solutions and many other leadership roles prior to becoming CIO, Nationwide Financial. Susan serves on the Board of Directors for Directions for Youth and Families. Susan holds a BS in Business Administration, Computer Science from The Ohio State University, Summa Cum Laude."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_OSU_Dorota_Grejner_fmt.jpeg"
"story":"Geodetic Science and Engineering (GSE) at OSU has a 55-year history of groundbreaking research, recognized worldwide. With 20 years of work in GSE. I am professionally recognized as a world leader and innovator in this field, with primary expertise in precise positioning, navigation, and tracking using the Global Positioning System (GPS) and its integration with other navigation/imaging technologies, and unconventional use of GPS for atmospheric studies. I developed a new, fast, and accurate method of GPS orbit estimation; the research team that I lead pushed the state-of-the-art in personal navigation, vital to rescue operations and dismounted soldiers, and, most recently, we developed a novel method of clandestine nuclear explosions detection using GPS signals. I have established and lead the Satellite Positioning and Inertial Navigation (SPIN) Laboratory, and am one of the leaders of the industrial Consortium of Ohio Universities on Navigation and Timekeeping (COUNT), whose members are from defense industry. I am a Fellow of the Institute of Navigation (ION) and International Association of Geodesy (IAG), and serve as an expert for National Academies and Air Force Research Lab (AFRL)."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_OSU_Jessica%20Winter_fmt.jpeg"
"url":"http://www.nano4neuro.com""
"story":"Dr. Jessica Winter is the H.C. “Slip” Slider associate professor in the departments of Chemical and Biomolecular Engineering (ChE) and Biomedical Engineering (BME) at The Ohio State University. She received her PhD in Chemical Engineering from the University of Texas at Austin in 2004 and completed a postdoctoral fellowship at the Center for Innovative Visual Rehabilitation, a collaborative effort between the Boston VA Hospital, Harvard Medical School, and the Massachusetts Institute of Technology. Dr. Winter joined the faculty at Ohio State University in 2006, where her research has focused on the creation of nanoparticles for medical applications. She has pioneered the development of fluorescent-magnetic nanoparticles for imaging, cell separations, and studies of the role of force in cell function. In addition, she has extended this technology to the development of polymer nanoparticles for drug delivery and non-toxic carbon nanoparticles for in vivo imaging. This work has resulted in six invention disclosures, four provisional patents, and interest from numerous companies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_Pearl%20Interactive__fmt.jpeg"
"url":"http://www.pearlinter.org""
"story":"Merry Korn launched Pearl Interactive Network, LLC in 2005 as a social enterprise with a mission to use technology to create a virtual contact center that provides career and job opportunities to people with skills and talents who have challenges to work such as disabled veterans, people with disabilities and people living in geographically challenged areas. Pearl Interactive Network contract services are: Call Center, Administrative Services, Help Desk and Staffing.Pearl Interactive Network’s business model is unique from a technology perspective. fully integrating and creating code between our VOIP Call Center software program and assistive technologies, enabling workers who are blind or cannot use their hands to access employment. Pearl Interactive allows businesses is access to a workforce with consistently high retention and high performance. In addition to certification as a woman business enterprise, Pearl Interactive has obtained certifications that position Pearl Interactive for great growth in the federal market. First quarter 2012, Pearl Interactive will have close to 60 employees and will have an additional 40 employees through a subcontractor relationship based out of Pennsylvania."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OWT_TeamDynamix_fmt.jpeg"
"url":"http://www.beingcheryl.com""
"story":"Cheryl Harrison has been recognized in Central Ohio as a thought leader in social media and digital marketing for over three years - at which time she was only 19.Currently, she serves as the Marketing Manager for TeamDynamix, the leading project portfolio management (PPM) software company for the Higher Education market. Since joining the company in 2010, she has improved software development communication, developed internal strategies for marketing and sales collaboration, and driven features and content for TeamDynamix’s private social networking Community for Higher Education IT professionals.Cheryl is also the Editor for local lifestyle website Drink Up Columbus, which has attracted tens of thousands of visitors since its April 2010 launch. In addition, she manages social media communication for businesses like Woodlands Tavern and organizes technology networking events including TechKaraoke Columbus."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OSUCAR_GiorgioRizz_fmt.jpeg"
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OSUCAR_OnoriSimona_fmt.jpeg"
"url":"http://www.car.osu.edu""
"story":"In partnership with various Ohio companies, CAR is playing a major role in supporting the commercialization of electronic power converters (Vanner), battery thermal management (Graftech), and engine exhaust sensors (Stoneridge). These activities involve multiple faculty and research staff in the center, and have each received funding from the Ohio Third Frontier program. CAR also has a history of engaging industry in research consortia; some 30 companies are currently paying members in one of the two consortia managed by CAR.CAR has served as an incubator for two companies that are currently housed at TechColumbus: PlugSmart and CAR Technologies LLC. In the case of PlugSmart, the center provided technical support and facilities in the form of engineering services to allow the company to strengthen its product portfolio. CAR Technologies LLC was created to translate advanced battery aging and characterization technology developed at OSU CAR."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OSUCAR_GiorgioRizz_fmt.jpeg"
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OSUCAR_OnoriSimona_fmt.jpeg"
"url":"http://www.car.osu.edu""
"story":"In partnership with various Ohio companies, CAR is playing a major role in supporting the commercialization of electronic power converters (Vanner), battery thermal management (Graftech), and engine exhaust sensors (Stoneridge). These activities involve multiple faculty and research staff in the center, and have each received funding from the Ohio Third Frontier program. CAR also has a history of engaging industry in research consortia; some 30 companies are currently paying members in one of the two consortia managed by CAR.CAR has served as an incubator for two companies that are currently housed at TechColumbus: PlugSmart and CAR Technologies LLC. In the case of PlugSmart, the center provided technical support and facilities in the form of engineering services to allow the company to strengthen its product portfolio. CAR Technologies LLC was created to translate advanced battery aging and characterization technology developed at OSU CAR."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Acceptd_fmt.jpeg"
"url":"http://www.getacceptd.com""
"story":"Acceptd is a web-based tool that simplifies the video application process for university programs. Uploading and managing application videos, audition tapes, and highlight films using Acceptd will streamline the process and save time and money for applicants and program directors."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Boxgroove_fmt.jpeg"
"url":"http://www.boxgroove.com""
"story":"Boxgroove.com is the first parameter driven yield utilization aggregator software for the private club industry. Boxgroove is bringing to the masses an opportunity to experience a private club’s luxury even though one may not be a member. No company has bridged this space with a self service site that welcomes everyone to participate. Most companies that have tried to implement a solution for this industry used a traditional call center and required one’s club to validate who you are. So you had to already “be” a member in order to participate at these existing companies. Boxgroove provides a new marketing channel for private clubs to acquire members utilizing the marketing principles of the ”endowment effect”. Boxgroove can now help clubs increase their exposure and prospective lead opportunity while maintaining their brand and control to the club."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_CardinalHealth_fmt.jpeg"
"url":"http://www.cardinalhealth.com""
"story":"Cardinal Health, Inc. is a Fortune 19 company that improves the cost-effectiveness of healthcare. As the business behind healthcare, Cardinal Health helps pharmacies, hospitals and ambulatory care sites focus on patient care while reducing costs, improving efficiency and quality, and increasing profitability. The labs team is a research and architecture team whose mission is to innovate, incubate and educate new technology and techniques. We do this through executing on business relevant projects."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_eVent_fmt.jpeg"
"url":"http://www.eEvent.com""
"story":"eEvent started out as an experimental project funded by eSolutech, a local Columbus, Ohio based Innovative IT Consulting and Concept Development company. With a great mission, passion, and drive of our team, we have developed a scalable business using innovative technology in a recovering economy. We created eEvent, an online platform to help many businesses market their events effectively and grow their customer’s base via events. Our team listened to what business owners needed to grow their business via event marketing and we built innovative mobile and web based solutions to fulfill these needs effectively."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_EXCMR_fmt.jpeg"
"url":"http://www.excmr.com""
"story":"EXCMR, Inc. develops and markets innovative products that enhance cardiovascular magnetic resonance (CMR) imaging. The Company’s patent pending MRI-compatible treadmill forms the basis for the first ever “next to magnet” exercise stress system enabling peak stress MR imaging of dynamic heart and vascular structures - providing the cardiologist a more effective and efficient tool to identify and treat cardiovascular diseases. In July 2011, EXCMR initiated a multi-site clinical evaluation of beta systems with funding from Ohio’s Third Frontier Medical Imaging Program. Information from this beta testing will be used to further refine the product and streamline the clinical procedure. The Company is targeting an early 2012 market introduction at the Society for Cardiovascular Magnetic Resonance World Conference. The Company’s management team has significant medical device, MR and cardiology experience and has led several successful medical technology start-ups from concept through launch and ramp up. EXCMR’s management team believes in fostering a creative, positive workplace where honesty, integrity, teamwork and open communication are core values."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Expedient_fmt.jpeg"
"url":"http://www.expedient.com""
"story":"Expedient Communications offers a wide range of managed hosting services such as virtualization, cloud computing, remote backups, management of equipment, storage area networks and more. These proven managed services combined with their eight top tier data centers enables Expedient to deliver premium colocation, network and managed services solutions to commercial, education and government entities. This blend of services, all under one roof, and the scale of the organization really sets Expedient apart from the competition. It enables them to have a complete view of their clients’ technical environment and makes Expedient accountable for ensuring that their customers’ systems will interact properly and have 100% uptime.During 2011, Expedient opened the most hardened commercially available data center in central Ohio. With the addition of this facility, companies in this region now have access to a single source provider for their primary computing and disaster recovery services. Previously they would have needed to work with multiple companies which can creates gaps in accountability or they would need to move their systems outside of the region. In two words Expedient provides DATA AVAILABILITY."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Jointvue_fmt.jpeg"
"url":"http://www.jointvue.com""
"story":"JointVue is poised to revolutionize care for patients with painful joint conditions by providing highly efficient, user-friendly products that will address a $300 million annual business opportunity. The company recently raised $1.25 million from external angel investors and is currently in the process of launching clinical trials of its flagship product, JointGuide, a state-of-the-art 3-D injection guidance tool that couples traditional ultrasound with proprietary imaging software. The creation of 3-D joint images and real-time guided joint injection represent major commercial opportunities for this medical imaging product company. In addition, the company is in advanced discussions with federal research sponsors and major strategic partners in their market. The company’s founders, industry-recognized thought leaders in orthopedic research and clinical practice, have nine patent applications pending to cover the JointVue technology platform. Their ultrasound-based imaging products provide high-resolution, real-time imaging to the physician’s office, eliminating the expense and hazards of radiation-based imaging techniques that are the current standard of care."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_MIHomes_fmt.jpeg"
"url":"http://www.mihomes.com""
"story":"Founded in 1976, M/I Homes is one of nation’s leading builders of single family homes. M/I has established an exemplary reputation based on a strong commitment to superior customer service, innovative design, quality construction and premium locations. Listed on the New York Stock Exchange, M/I Homes serves a broad segment of the housing market including first-time, move-up, luxury and empty nester buyers.The Technology team at M/I has had to endure a downsizing that has trimmed the team by more than 50 percent. In spite of the significant reductions, the team has been able to replace and integrate all of the core homebuilding systems within the company over the past 6 years. This has led to significant productivity gains throughout the company at a time when it was needed the most. Most recently, the team has built a mobile website, added an email customer care and marketing system to the existing CRM system, performed a full upgrade of the existing ERP and CRM systems and added two new divisions to the company (one via acquisition)."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_NationwideChildren_fmt.jpeg"
"url":"http://www.nationwidechildrens.org""
"story":"Nationwide Children’s is a non-profit free-standing Children’s Hospital founded in 1892. Nationwide Children’s serves all children regardless of families’ ability to pay, is America’s 5th largest Children’s Hospital, Top 10 Research Center, has 1 million patients visits / admissions annually, referrals from all 50 states and 35 countries, 7,500 employees, and is the Department of Pediatrics for The Ohio State University. I have nominated the Nationwide Children’s Infrastructure Team for the Outstanding Technology Team based on the team’s ability to be innovative to meet the organization’s largest facility expansion to date, while continuing to maintain critical day-to-day operations. Nationwide Children’s Hospital was ranked 107 on the InformationWeek 500 list, an annual listing of the nation’s most innovative users of business technology. This is the second-consecutive year the hospital has earned a spot on the InformationWeek 500."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_NationwideFinancia_fmt.jpeg"
"url":"http://www.nationwide.com""
"story":"Nationwide is a long-standing Fortune 500 company. With over 15 million customers, Nationwide is a leading provider of personal and commercial property and casualty insurance and long-term retirement savings products. Over the last 80 years, Nationwide has grown to one of the largest insurance and financial services companies in the world. Nationwide’s diversity is the key to its strength: #1 provider of public-sector retirement plans, #1 writer of farmowner insurance, 6th largest auto insurer in the United States, 7th largest homeowner insurer in the United States and 9th largest variable annuities provider.Nationwide strives to deliver high quality technology services to our customers. Building systems that our customers love has been a key emphasis at Nationwide. Efficient, reliable testing practices provide more timely delivery at lower costs to our customers. Nationwide has demonstrated this through the use of testing automation. Automating testing for Integrated Voice Response systems has not been forthcoming in the industry. Nationwide pioneered a solution that has resulted in dramatic improvements with testing throughput."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Nationwide_Ramasam_fmt.jpeg"
"url":"http://www.nationwide.com""
"story":"Nationwide is a leading insurance and financial service provider with 35,000+ employees. To provide state-of-the-art, high quality service to its customers, Nationwide relies heavily on its IT technology base. To meet this need, Nationwide Application Development Center (ADC) leverages innovative IT delivery construct that uses Lean Management techniques to improve speed, quality and productivity. ADC goes against the grain of today’s popular trend of outsourcing while still delivering higher quality work at a price point that is comparable to IT providers with lower labor costs. Over the past two years, ADC has added hundreds of new IT positions. ADC is one of the first large-scale agile software development organization assessed at CMMI Level 3.The ADC has delivered 94 software releases since October 2010 with 20% better productivity than industry average and 56 (59.6%) of these releases have ZERO production defects. This is industry leading quality and the ADC development teams are able to see this broad-based success for multiple applications and across different technologies by leveraging Acceptance Test Driven Development quality processes and techniques."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Nationwide_DIppoli_fmt.jpeg"
"url":"http://www.nationwide.com""
"story":"At Nationwide, we take customer service seriously. As one of the largest insurance and financial services companies in the country, we know that putting our customers first has allowed us to become an industry leader.This systematic and rapid response to help our policyholders is largely accomplished by utilizing Nationwide’s vast proprietary IT applications. It is essential that those applications are available and functioning properly in order to fulfill our promise. The problem statement provided to the team included minimizing the disruption of IT failures to our end users, while establishing monitoring solutions that allow internal IT resources to react to failures in a more efficient manner. Nationwide is the first company to integrate the Tealeaf tool with HP Service Center to automatically detect and alert from customer web sessions covering a majority of previously undetectable failures. Nationwide was able to custom develop a data feed to allow a single proactive view of mainframe and distributed message queue health metrics. During 2011, these solutions have helped prevent or limit major business impacts to our end users in 31 instances."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Neoprobel_fmt.jpeg"
"url":"http://www.neoprobe.com""
"story":"Neoprobe Corporation is a biomedical company focused on enhancing oncology patient care and improving patient benefit through radiopharmaceutical product development. Neoprobe is actively developing a radiopharmaceutical agent platform Lymphoseek to help surgeons better identify and treat certain types of cancer. Neoprobe’s strategy is to deliver superior growth and shareholder return by bringing to market novel radiopharmaceutical agents and advancing the Company’s pipeline program through continued investment and selective acquisitions."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OhioDODD_fmt.jpeg"
"url":"http://www.dodd.ohio.gov""
"story":"The Ohio Department of Developmental Disabilities (DODD) is charged with overseeing a statewide system of support services for some 90,000 people with developmental disabilities. The state provides early intervention and special education services for children, and a range of adult services to support training, employment and residential needs. With 90% percent of its desktops at the end of their five-year lifecycle, the DODD Infrastructure team was tasked with leveraging the massive benefits already realized through virtualizing the agency’s servers with VMware vSphere by virtualizing 1,500 desktops (nearly all of its users) with a program that would simplify management, deliver all needed applications to a diverse employee population, speed provisioning to associates in 10 developmental centers across the state, and increase privacy and security. DODD’s deployment of VMware’s View virtual desktop software is one of the largest known state and local government roll-outs in the U.S. according to Brian Feller, VP of sales and operations at WhipTail."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OhioHealth_fmt.jpeg"
"url":"http://www.ohiohealth.com""
"story":"The OhioHealth Information Services department is a team of more than 350 people who support the corporate enterprise care sites, physician practices and business areas. There are several factors that set them apart. First, the team is part of a changing environment that embraces mobile technologies, patient engagement and experiences, clinical quality and altered workflows in both the inpatient and outpatient areas of healthcare. Second, the size of the department provides associates with the opportunity to apply their skills to the development and support of IT solutions. While many of the IT associates are technically trained, others are clinically trained and have migrated into IT professionally. And finally, the team is passionate about service excellence. After adopting a best-practice Information Technology Infrastructure Library approach five years ago, the department has increased its competence in many process areas, as well as in customer service skills. The team’s work on the Mobile Mammography and Bone Density Project clearly demonstrates how these attributes are successfully applied to a real-life situation."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_OSUEngineering_Rog_fmt.jpeg"
"url":"http://www.socialinnovationinitiative.org/about-us/team.php""
"story":"The Social Innovation and Commercialization program has been formed through the collaboration of the Tony R Wells Foundation, The Ohio State University, and a number of local, not-for-profit organizations. The program applies transdisciplinary teams of students to define, design, and commercialize products for people with disabilities. Resulting revenue is returned to our non-profit partner.Major benefits of the program include: (1) improve independence of people with disabilities, (2) help non-profits become self sustaining, and (3) create the next generation of social entrepreneurs."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_Phylogeny_fmt.jpeg"
"url":"http://www.phylogenyinc.com""
"story":"Phylogeny aims to accelerate the discovery of new therapeutics and diagnostics for human health by enabling scientists to achieve excellence in functional genomic research.Since 1997, Phylogeny, Inc. has served thousands of researchers at both companies and institutes who are engaged in genomic research. Phylogeny’s technology serves clients in the corporate sector, including most biotech companies and ALL top tier pharmaceutical companies.Phylogeny is dedicated to supporting streamlined identification and validation of therapeutic and diagnostic strategies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_QStart_fmt.jpeg"
"url":"http://www.qstartlabs.com""
"story":"QStart Labs provides start ups, investors, and established firms an experienced technology development and start up advisory team made up of entrepreneurs, designers, nerds, and investors that are changing the way that new businesses are launched on the web.QStart Labs employs top developers that believe in a pragmatic, fun atmosphere that keeps motivation high, and outcomes hugely successful. Their team of “Rock Star” talent is the perfect fit for assisting start ups with one-of-a-kind technology platforms, tailored specifically to fit their needs."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_RiversideRadiology_fmt.jpeg"
"url":"http://www.riversiderad.com""
"story":"The Riverside Radiology and Interventional Associates (RRIA) IT Division’s launch of Lucid Radiology Solutions and the RadAssist product is a milestone in the group’s ongoing commitment to pushing the envelope to drive higher quality imaging exam results reporting for health system partners, patients and referring physicians. RadAssist is undoubtedly providing a level of service and innovation unmatched in the marketplace. These IT capabilities continue to exceed national best practice scores in all categories measured. In addition, the RRIA IT Division has assisted the group in achieving national recognition, including being ranked 11th by Radiology Business Journal’s 50 Largest Private Radiology Practices in the nation for the second year in a row, as well as once agin securing the top spot as the official radiology group for the NHL franchise Columbus Blue Jackets. More recent recognition includes being named in the top 50 Best Places to Work in Healthcare by Modern Healthcare, selected by Columbus Business First as a ” Best Places to Work” and a finalist in the TechColumbus Innovation Awards."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OTT_SoftSyl_fmt.jpeg"
"url":"http://www.softsyl.com""
"story":"SoftSyl Technologies brings total end-to-end Interactive Voice Response (IVR) and telephony solutions to businesses and call centers of all sizes, in any industry. The company’s technology team has over 15 years of experience with designing and developing IVR systems for Fortune 500 companies. By leveraging this experience, SoftSyl Technologies has built an enterprise-class, cost-effective, proprietary platform that integrates with any IP phone system and at the same time maintains full industry compliance. The company eliminates multi-vendor dependency by offering analysis, design, development, deployment, and support for hosted and on-site solutions."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/NPS_WrightCenter_fmt1.jpeg"
"url":"http://www.radiology.osu.edu/11205.cfm""
"story":"The Wright Center of Innovation in Biomedical Imaging (WCI-BMI) at OSU has teamed up with The Ohio State University Medical Center (OSUMC) Center for Neuromodulation to simultaneously and synergistically leap forward existing neuroimaging and neuromodulation / deep brain stimulation technology. Together they seek to develop, pursue and validate the most innovative, minimally invasive, neurosurgical procedures to create advanced or new treatments for otherwise incurable ailments. Neuromodulation / deep brain stimulation requires not only exceptional neurosurgical skills and experience, but critically depends on non-invasive imaging to identify, map and visualize ultra-detailed neuro-anatomy, neuro-function and neuro-connectivity as well as non-invasive techniques to guide the fine-tuning of the modulation techniques. For leading edge technology teams to work and develop in highly interactive, well-known yet cocooned environments, bringing different technology efforts together, requires a common cause and goal. This is the common thread throughout the teams: advancing technology to help improve patient’s lives through breakthrough technologies. Within the last year, the integrated and well aligned team has broken through many perceived technology constraints in imaging technologies and leaped capabilities to advance therapeutic options."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_OwensCorning_Eco_fmt.jpeg"
"url":"http://www.owenscorning.com""
"story":"EcoTouch insulation is a new fiber glass insulation product that was launched by Owens Corning in late 2010 and early 2011. Owens Corning is a leading global producer of residential and commercial building materials, glass-fiber reinforcements and engineered materials for composite systems, with sales of $5.0 billion in 2010 and about 15,000 employees in 28 countries on five continents. EcoTouch was developed at Owens Corning’s Science and Technology center in Granville, Ohio. It represents a unique combination of total product performance (preferred by 2 out of 3 professional insulation installers) and sustainable product attributes (99% natural, 58% recycled content, GREENGUARD Children and Schools certified for indoor air quality and verified to be formaldehyde-free). EcoTouch sales have exceeded $200 million to date, and it has received national recognition as an innovative building materials product, including being ranked among the top five best new products of 2011 by Professional Builder and Professional Remodeler magazines, and being the first fiberglass insulation to be certified by the U.S. Department of Agriculture (USDA) as a Biobased product."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_Battelle_fmt.jpeg"
"url":"http://www.battelle.org""
"story":"Battelle is the world’s largest non-profit, independent research and development organization. It generates innovative products and solutions through four global businesses: Health and Life Sciences, National Security, Energy Technology and Laboratory Management. By leveraging its broad spectrum of capabilities and expertise in science, technology and leadership, Battelle has developed the Resource Effective Bio-Identification System, also known as REBS.REBS significantly decreases the time required to detect and identify problems in manufacturing processes. Identification that typically requires days now requires just minutes. This breakthrough development offers: 1) a unique combination of identification and detection; 2) single cell sensitivity; 3) non-destructive detection that allows for secondary confirmation; and 4) an extensible and customizable library."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_CardinalHealth_fmt.jpeg"
"url":"http://www.cardinalhealth.com""
"story":"Cardinal Health, Inc. is a Fortune 19 company that improves the cost-effectiveness of healthcare. As the business behind healthcare, Cardinal Health helps pharmacies, hospitals and ambulatory care sites focus on patient care while reducing costs, improving efficiency and quality, and increasing profitability. InfusaTrack is an Infusion Suite management solution for rheumatology clinics. InfusaTrack allows clinics to track incoming patients from point of prescription of treatment through to billing and keep track of complicated patient specific inventory."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_CommercialVehicleG_fmt.jpeg"
"url":"http://www.cvgrp.com""
"story":"Commercial Vehicle Group, Inc. is a leading supplier of fully integrated system solutions for the global commercial vehicle market, including the heavy-duty truck market, the construction and agriculture markets, the specialty and military transportation markets. The company has an array of research and development tools to aide CVG as it works with its customers toward design improvements, vehicle performance, operator safety and comfort. FlameTEK is a flame self-extinguishing interior trim product. It is the result of extensive research and development efforts of CVG to solve the many challenges faced by soldiers inside a military vehicle. FlameTEK forms a protected interior covering and shields the occupants from flames, toxic smoke inhalation, extensive noise and heat. It is ideally suited for all military, passenger bus, rail, aviation, marine and commercial vehicle applications. In addition to being self-extinguishing (material exceeds UL94-V0), this new trim technology offers enhanced safety for the passengers of the vehicle which include acoustical benefits as well as increased thermal performance to improve HVAC operation which also leads to reduction in fuel consumption."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_OwensCorning_fmt.jpeg"
"url":"http://www.ocvreinforcements.com""
"story":"Owens Corning, a $5 billion sales company headquartered in Toledo is the #1 supplier to the wind industry with a full range of glass fibers and woven solutions. In 2010, a new glass fabric solution for making lighter, longer and stiffer wind blades has been introduced as Ultrablade. Wind Blades are indeed made from resins reinforced by glass tissues also called fabrics obtained by weaving of glass fibers (the core competency of Owens Corning). This Ultrablade Innovation is the combination of 3 innovations: a new High Modulus glass fiber, an improved compatibility between resins and glass, and a new fabric design. Ultrablade helps designers develop lighter longer blades exceeding 60 m long, increased lifetime up to several decades. The result of this technology is up to 20 % cost material saving, making the wind energy not only a clean source of energy, but also a cost effective one. Ultrablade is a proven wind energy solution allowing Owens Corning to capture significant incremental sales, securing a leading position as supplier of Wind Energy."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/OPL_Veeam_fmt.jpeg"
"url":"http://www.veeam.com""
"story":"Veeam is a self-funded, rapidly growing company based in Columbus that develops management, backup and recovery software for virtual environments. The trend toward virtualization is an IT transformation on the scale of past innovations such as client-server computing and the advent of the PC. Veeam is adding about 1,500 new customers per month, with more than 30,000 total customers worldwide. The company currently employs nearly 600 people globally. Veeams rapid growth is due to its constant innovation in response to customer feedback.Customer input has helped Veeam develop several patent-pending capabilities for its flagship product, Veeam Backup & Replication v5. These new features help companies’ IT departments to recover virtual servers in minutes, as opposed to the hours of downtime associated with traditional physical backup software, which can cripple productivity. Visit www.veeam.com or follow @veeam on Twitter for more."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_Schmittgen_fmt.jpeg"
"story":"Dr. Thomas Schmittgen is an Associate Professor and Chair of the Division of Pharmaceutics at The Ohio State University. His research focuses on the role of noncoding RNA towards the early detection, pathogenesis and treatment of cancer. He holds the patent (pending) for the microRNA genetic signature for pancreatic cancer; technology that will be used for the early detection of pancreatic cancer. Dr. Schmittgen has over 50 publications and has received numerous grants from the NCI and other federal agencies. He is the co-author of a paper describing a widely used method of gene quantification. This paper has over 13,000 citations and was the most cited paper across 22 scientific disciplines from 2000-2010 according to Thompson Reuters. "
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_Battelle_Benecke_fmt.jpeg"
"url":"http://www.battelle.org""
"story":"Headquartered in Columbus, Ohio, Battelle is an independent research and development organization and provides innovative solutions to the world’s most pressing needs: Health and Life Sciences; Laboratory Management; National Security; and Energy, Environment and Material Sciences. Dr. Benecke, a career-long innovator at Battelle, has dedicated his talent, experience, and research to successfully develop and commercialize sustainable and green products which compete with well-established petroleum-based products, from both performance and economics standpoints."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_CapstoneInnovation_fmt.jpeg"
"url":"http://www.capstoneinnovations.com""
"story":"Capstone Innovations, of Marysville Ohio, is a product design firm that strives to bring innovative products to multiple markets. Our first innovation is the Fast Lock Pallet, a patent pending adaptable interlocking pallet system that allows the user to build a pallet to any size quickly and easily. The Fast Lock Pallet offers improved adaptability, efficiency, organization and ease of use over existing pallet designs."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_Celartia_fmt.jpeg"
"url":"http://www.celartia.com""
"story":"This year, Dr. Emilio-Barbera Guillem received his 42nd issued patent; a European Patent based on the groundbreaking Petaka bioreactor, which has previously received two U.S. patents. His 41 U.S. patents granted since 1996 cover areas of cellular biology including cell culture, cancer treatment, fluorescent nanocrystal production, and polynucleotides for inhibiting cancer growth and metastasis.Because of his scientific expertise and proven experience in founding start-up technologies, he was invited, and recently completed, a two year appointment as Minister for Technology Development for the State of Valencia, Spain, where he worked to encourage new companies and the growth of the entrepreneurial spirit in that region. Dr. Barbera, who is now a U.S. citizen living in Powell, Ohio, has served as the President of the University of the Basque Country in Spain, and his writings have appeared 124 times in peer-reviewed journals and in 9 book chapters.In the last two years, he has taken his current Columbus company, Celartia Ltd., from 2009 beta-test sales of a revolutionary cell culture bioreactor to world laboratory purchases of over 80,000 units in 2011."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_DNA%20Concepts_fmt.jpeg"
"story":"DNA Concepts is a software solutions company focused on developing innovating products using Augmented Reality technology. Our initial product ideas focused in two product segments: toys and textiles.Innovative toys will combine a physical product with an augmented reality character that a child can manipulate on screen. When viewed from a smart device, the characters come to life, can interact with one another and can play with toys and games added to the scene with new AR markers.Our innovative textile products enable characters to come to life off of natural feature tracking augmented reality that is triggered by bedding, slumber bags and pillows."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_DuncanDental_fmt.jpeg"
"url":"http://www.duncandentallabs.com""
"story":"Duncan Dental Lab fabricates dental appliances. For some items, the techniques are over 40 years old compared to more modern day techniques. Duncan Dental Lab has not only thought of better ways , but we have too acquired a patent for our new innovations. Our innovation is a better way to precisely drill and place dental implants into a patient’s jaw bone. We invented a surgical technique measuring the width, depth of a patient’s jaw bone. We created a surgical guide with patented parts that will guide a predrill, in order to drill the exact spot that the implant will be placed without any lateral movement of the drill. After predrilling, our innovation will then guide final drilling at the correct depth. Also, with our technique, in addition to precise drilling we can immediately place the final restoration after surgery."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_Nanofiber_fmt.jpeg"
"url":"http://www.nanofibersolutions.com""
"story":"Nanofiber Solutions manufactures revolutionary three-dimensional nanofiber technologies for cell culture and cancer research, stem cell expansion and tissue engineering solutions. We employ a technology platform that provides researchers with more biologically realistic cell culture leading to more effective biomedical research, earlier breakthroughs, faster and cheaper time to market for drug development, and improved stem cell expansion and differentiation.Our Synthetic Nanofiber Trachea implant was developed at the request of surgeons from the Karolinska Institutet in Stockholm, Sweden. This implant was first used in a human in November, 2011 helping to save and extend a terminally ill patient’s life. This surgery was only the second instance of a synthetic trachea replacement in a human. Further human trials are in progress with the surgeons from the Karolinska Institutet. Additionally, we are now using the skills and techniques developed to create a new version of the Synthetic Nanofiber Trachea targeting the small dog market. Working with surgeons and researchers at the Ohio State University School of Veterinary Medicine we hope to implant this life-saving new product within a few months. "
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_Baiocchi_fmt.jpeg"
"story":"The laboratory of Dr Baiocchi at The Ohio State University’s Comprehensive Cancer Center focuses on discovering novel strategies to prevent and treat cancer. His team is presently developing a vaccine to boost immunity to the Epstein-Barr virus to prevent malignant diseases such as lymphoma as well as benign conditions like infectious mononucleosis. To enhance this vaccine, several immune adjuvant strategies are being developed in parallel. Dr Baiocchi also leads a team of investigators who have discovered a novel class of drug that inhibits the PRMT5 enzyme, a protein that is dysregulated in diseases including glioblastoma multiforme (GBM), lung cancer and lymphomas. New small-molecule compounds have shown great promise in blocking PRMT5 activity leading solid and blood cancer cells to restore important regulatory networks, decreased growth, cell death, and production of immune-modulating hormones that can induce anti-tumor immunity. While this new class of drug is currently being tested in preclinical cancer models (brain tumors: GBM, lymphoma), it is Dr Baiocchi’s goal to translate this drug into the clinic to improve treatment options of patients with cancer."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_Finer_fmt.jpeg"
"url":"http://www.oardc.ohio-state.edu/plantranslab/default.htm""
"story":"Research efforts in the Finer Laboratory of The Ohio State University have focused on genetic transformation and transgene expression in crop plants. Although the main emphasis in the laboratory is currently on production and evaluation of transgenic soybean and sunflower, the laboratory has additional experience with wheat, maize, tomato, bentgrass, cotton, white pine, Chinese yam, Christmas cactus and Ohio buckeye. We were the first university laboratory to report consistent recovery of transgenic plants of cotton, soybean and corn. Embryogenic tissues are used for both basic studies on plant growth and development and as targets for transformation. In the area of gene expression, we are developing automated image capture and analysis for promoter evaluation using the green fluorescent protein. Images, collected over time, are both quantitatively analyzed for gene expression and used to generate time-lapse animations of tissue growth and gene expression. The animations reveal unique features of the subject materials, which are clearly not visible from single time point image collections. An automated image collection and analysis system is currently being considered for commercialization with industrial partners."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_HeshamElGamal_fmt.jpeg"
"url":"http://www.ece.ohio-state.edu/~helgamal""
"story":"This invention introduces a breakthrough technology for mobile content distribution that combines sophisticated machine learning techniques for user profiling with advanced scheduling algorithms to improve the network efficiency and enhance the user experience. The technology is covered by two recent patent filings and is currently being developed for a variety of mobile platforms and network architectures."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_JLi_fmt.jpeg"
"url":"http://www.fst.osu.edu/li/default.htm""
"story":"Nominee for Innovator of the Year Dr. Jianrong Li is an Assistant Professor in the College of Food, Agricultural and Environmental Sciences at The Ohio State University. Dr. Li has focused his innovative work on the development of novel processing technologies, mitigation strategies, vaccines, and anti-viral interventions against food- and water-borne viruses (such as human norovirus) and respiratory viruses (such as human metapneumovirus) with an ultimate goal of improving food safety and public health. Dr. Li has been PI or co-PI of over 20 sponsored projects and has been awarded over $6.0M in funds from the National Institutes of Health (NIH) and the U. S. Department of Agriculture (USDA) since he started at OSU in 2008. His work has led to more than 30 publications in leading virology and microbiology journals. His work on human norovirus and human metapneumovirus has led to five patent applications. These inventions include novel sanitizers in mitigation of norovirus in fresh produce, novel food processing technologies in eliminating norovirus in high risk foods, and new vaccines against human norovirus and human metapneumovirus."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_YeboLi_fmt.jpeg"
"url":"http://www.oardc.ohio-state.edu/bioenergy/pageview.asp?id=1170""
"story":"Dr. Yebo Li is an assistant professor in the Department of Food, Agricultural, and Biological Engineering at The Ohio State University. Dr. Li has developed a successful research and extension program in bioproducts and bioenergy. He has developed a novel technology for the production of polyurethane foam from renewable source to be used in a variety of products including automotive seats, headrests, and bumpers; sealants and thermal insulation systems for refrigerators; insulation boards; and packaging materials. The product, known as biopolylols, is made from crude glycerin, a byproduct of biodiesel production that is considered waste and has little commercial value. When mixed with biomass through a patented process that he developed, the crude glycerin becomes the foundation for making the biopolyols and polyurethane foam. His product is comparable to petroleum-based foam in quality; however, his product is renewable and is less expensive to produce than petroleum-based foams. Dr. Li’s technology has been licensed to Poly-Green Technologies, a start-up company in Mansfield, Ohio, for commercial production."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_Sadee_fmt.jpeg"
"url":"http://www.pharmacogenomics.osu.edu/""
"story":"Since joining OSU, Dr. Sadee has developed a Program in Pharmacogenomics, aimed at discovery of genetic variations associated with disease risk and treatment outcomes, now funded by a $9 million NIH grant. Companion diagnostic biomarkers can optimize and individualize drug therapy, a central tenet of the emerging era of personalized medicine. With novel genomics methodologies, we have identified several frequent genetic variants in key candidate genes with strong clinical effects, showing potential as companion diagnostics (patent applications are pending), while clinical applications have already begun. Drug-companion diagnostics (”theranostics”) are still in infancy but considered a main future direction of medicine; indeed, a companion diagnostic may equal the value of a new drug entity. In separate studies, he has developed neutral opioid antagonists for treatment of opioid side effects and abuse liability. Secured by strong patent backing, the first drug candidate has passed through Phase I clinical trials with promising results (supported by AIKO Biotechnology). With ~200 million opioid analgesic prescriptions per year, substantially improved analgesic preparations have enormous clinical utility and market potential."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_YiZhao_fmt.jpeg"
"url":"http://www.zhaolab.openwetware.org""
"story":"Dr. Yi Zhao is an assistant professor in Department of Biomedical Engineering at The Ohio State University. He received his PhD degree in Manufacturing Engineering from Boston University, and joined OSU in 2006. He has led the Laboratory for Biomedical Microsystems since then. His research interests include the development of miniaturized devices to address unmet challenges in basic biological studies and point-of-case diagnosis. He is also interested in exploring the mechanical, material and fabrication issues involved in development of micro/nanodevices. He is a recipient of NSF CAREER awards. He is currently on the way to commercializing several technologies spun off from his research, including a wearable sensing system for rehabilitation assessment, and a bio-inspired device for endoscopic imaging."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_OSU_Jessica%20Winter_fmt.jpeg"
"url":"http://www.nano4neuro.com""
"story":"Dr. Jessica Winter is the H.C. “Slip” Slider associate professor in the departments of Chemical and Biomolecular Engineering (ChE) and Biomedical Engineering (BME) at The Ohio State University. She received her PhD in Chemical Engineering from the University of Texas at Austin in 2004 and completed a postdoctoral fellowship at the Center for Innovative Visual Rehabilitation, a collaborative effort between the Boston VA Hospital, Harvard Medical School, and the Massachusetts Institute of Technology. Dr. Winter joined the faculty at Ohio State University in 2006, where her research has focused on the creation of nanoparticles for medical applications. She has pioneered the development of fluorescent-magnetic nanoparticles for imaging, cell separations, and studies of the role of force in cell function. In addition, she has extended this technology to the development of polymer nanoparticles for drug delivery and non-toxic carbon nanoparticles for in vivo imaging. This work has resulted in 6 invention disclosures, 4 provisional patents, and interest from numerous companies."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_Quanta%20Bio%20Design_fmt.jpeg"
"url":"http://www.quantabiodesign.com""
"story":"Quanta’s offers over 400 discrete (single molecule) compounds, some of which are in current approved commercial diagnostic products and are in numerous preclinical and early clinical trials. Quanta’s revenues have grown regularly at 25-40% annually. Quanta is working with its first customer to get an IND submitted in Q1 of 2012 for a childhood neuroblastoma as a curative cancer vaccine that has been assigned orphan drug status.The FDA desires characterization and reproducibility of approved diagnostic products and therapeutic drugs. The purity of Quanta’s dPEG compounds for the first time enables manufacturers the ability to produce characterizable and reproducible diagnostic products and therapeutic drugs. Dr. Davis’ invention is to directly manufacture high purity PEG compounds by a process scalable to make up to several metric tons of his dPEG compounds. Dr. Davis’ new dPEG compound production method is platform technology in the diagnostic and therapeutic arenas, specifically, in the development of new cancer diagnostic products and therapeutic drugs. Dr. Davis not only re-invented PEG compounds, but he runs a company that manufactures and sells such re-invented compounds worldwide."
},
{
"image":"IA2011_EventProgram_WEBSITE-web-images/IOY_SaVvy_fmt.jpeg"
"url":"http://www.savvyeng.com""
"story":"A 1981 MIT graduate with BS degrees in Mechanical Engineering and Life Sciences, Scott Vierstra spent 18 years with American Electric Power Service Corporations Steam Generation Section, providing engineering services to the AEP power plants. While at AEP, Scott developed a strong interest in combustion systems and eventually played a significant technical role in the companys NOx emissions compliance for the Clean Air Act (Title IV). In 1999, Scott started SAVvy Engineering LLC, which has focused on providing engineering and consulting services to the utility industry (including power producers and their equipment suppliers), domestic and international. This work has included developing combustion system solutions including fuel specifications, hardware design and development and modifications to existing equipment for improved emissions, operational efficiency and reliability.Scott has three patents for low NOx burners and three patents pending for two different coal classifier technologies and a coal to chemical reactor for combined power and chemical production. In 2009, SAVvy Engineering assisted and has participated with the startup and development of Ohio Valley Testing which provides regional testing support to power plants."
}
 ]
